{"alert":{"type":"Module","doc":"Simple on-screen alerts","def":"-> hs.alert"},"appfinder":{"type":"Module","doc":"Easily find `hs.application` and `hs.window` objects\n\nThis module is *deprecated*; you can use `hs.window.find()`, `hs.window.get()`, `hs.application.find()`,\n`hs.application.get()`, `hs.application:findWindow()` and `hs.application:getWindow()` instead.","def":"-> hs.appfinder"},"applescript":{"type":"Module","doc":"Execute AppleScript code\n\nThis module has been replaced by: [hs.osascript.applescript](./hs.osascript.html#applescript)","def":"-> hs.applescript"},"application":{"type":"Module","doc":"Manipulate running applications","def":"-> hs.application"},"audiodevice":{"type":"Module","doc":"Manipulate the system's audio devices\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.audiodevice"},"axuielement":{"type":"Module","doc":"This module allows you to access the accessibility objects of running applications, their windows, menus, and other user interface elements that support the OS X accessibility API.\n\nThis module works through the use of axuielementObjects, which is the Hammerspoon representation for an accessibility object.  An accessibility object represents any object or component of an OS X application which can be manipulated through the OS X Accessibility API -- it can be an application, a window, a button, selected text, etc.  As such, it can only support those features and objects within an application that the application developers make available through the Accessibility API.\n\nIn addition to the formal methods described in this documentation, dynamic methods exist for accessing element attributes and actions. These will differ somewhat between objects as the specific attributes and actions will depend upon the accessibility object's role and purpose, but the following outlines the basics.\n\nGetting and Setting Attribute values:\n * `object.attribute` is a shortcut for `object:attributeValue(attribute)`\n * `object.attribute = value` is a shortcut for `object:setAttributeValue(attribute, value)`\n   * If detecting accessibility errors that may occur is necessary, you must use the formal methods [hs.axuielement:attributeValue](#attributeValue) and [hs.axuielement:setAttributeValue](#setAttributeValue)\n   * Note that setting an attribute value is not guaranteed to work with either method:\n     * internal logic within the receiving application may decline to accept the newly assigned value\n     * an accessibility error may occur\n     * the element may not be settable (surprisingly this does not return an error, even when [hs.axuielement:isAttributeSettable](#isAttributeSettable) returns false for the attribute specified)\n   * If you require confirmation of the change, you will need to check the value of the attribute with one of the methods described above after setting it.\n\nIteration over Attributes:\n * `for k,v in pairs(object) do ... end` is a shortcut for `for k,_ in ipairs(object:attributeNames()) do local v = object:attributeValue(k) ; ... end` or `for k,v in pairs(object:allAttributeValues()) do ... end` (though see note below)\n    * If detecting accessibility errors that may occur is necessary, you must use one of the formal approaches [hs.axuielement:allAttributeValues](#allAttributeValues) or [hs.axuielement:attributeNames](#attributeNames) and [hs.axuielement:attributeValue](#attributeValue)\n   * By default, [hs.axuielement:allAttributeValues](#allAttributeValues) will not include key-value pairs for which the attribute (key) exists for the element but has no assigned value (nil) at the present time. This is because the value of `nil` prevents the key from being retained in the table returned. See [hs.axuielement:allAttributeValues](#allAttributeValues) for details and a workaround.\n\nIteration over Child Elements (AXChildren):\n * `for i,v in ipairs(object) do ... end` is a shortcut for `for i,v in pairs(object:attributeValue(\"AXChildren\") or {}) do ... end`\n   * Note that `object:attributeValue(\"AXChildren\")` *may* return nil if the object does not have the `AXChildren` attribute; the shortcut does not have this limitation.\n * `#object` is a shortcut for `#object:attributeValue(\"AXChildren\")`\n * `object[i]` is a shortcut for `object:attributeValue(\"AXChildren\")[i]`\n   * If detecting accessibility errors that may occur is necessary, you must use the formal method [hs.axuielement:attributeValue](#attributeValue) to get the \"AXChildren\" attribute.\n\nActions ([hs.axuielement:actionNames](#actionNames)):\n * `object:do<action>()` is a shortcut for `object:performAction(action)`\n   * See [hs.axuielement:performAction](#performAction) for a description of the return values and [hs.axuielement:actionNames](#actionNames) to get a list of actions that the element supports.\n\nParameterizedAttributes:\n * `object:<attribute>WithParameter(value)` is a shortcut for `object:parameterizedAttributeValue(attribute, value)\n   * See [hs.axuielement:parameterizedAttributeValue](#parameterizedAttributeValue) for a description of the return values and [hs.axuielement:parameterizedAttributeNames](#parameterizedAttributeNames) to get a list of parameterized values that the element supports\n\n   * The specific value required for a each parameterized attribute is different and is often application specific thus requiring some experimentation. Notes regarding identified parameter types and thoughts on some still being investigated will be provided in the Hammerspoon Wiki, hopefully shortly after this module becomes part of a Hammerspoon release.","def":"-> hs.axuielement"},"base64":{"type":"Module","doc":"Base64 encoding and decoding\n\nPortions sourced from (https://gist.github.com/shpakovski/1902994).","def":"-> hs.base64"},"battery":{"type":"Module","doc":"Battery/power information\nAll functions here may return nil, if the information requested is not available.\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.battery"},"bonjour":{"type":"Module","doc":"Find and publish network services advertised by multicast DNS (Bonjour) with Hammerspoon.\n\nThis module will allow you to discover services advertised on your network through multicast DNS and publish services offered by your computer.","def":"-> hs.bonjour"},"brightness":{"type":"Module","doc":"Inspect/manipulate display brightness\n\nHome: https://github.com/asmagill/mjolnir_asm.sys\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.brightness"},"caffeinate":{"type":"Module","doc":"Control system power states (sleeping, preventing sleep, screen locking, etc)\n\n**NOTE**: Any sleep preventions will be removed when hs.reload() is called. A future version of the module will save/restore state across reloads.","def":"-> hs.caffeinate"},"camera":{"type":"Module","doc":"Inspect the system's camera devices","def":"-> hs.camera"},"canvas":{"type":"Module","doc":"A different approach to drawing in Hammerspoon\n\n`hs.drawing` approaches graphical images as independent primitives, each \"shape\" being a separate drawing object based on the core primitives: ellipse, rectangle, point, line, text, etc.  This model works well with graphical elements that are expected to be managed individually and don't have complex clipping interactions, but does not scale well when more complex combinations or groups of drawing elements need to be moved or manipulated as a group, and only allows for simple inclusionary clipping regions.\n\nThis module works by designating a canvas and then assigning a series of graphical primitives to the canvas.  Included in this assignment list are rules about how the individual elements interact with each other within the canvas (compositing and clipping rules), and direct modification of the canvas itself (move, resize, etc.) causes all of the assigned elements to be adjusted as a group.\n\nThe canvas elements are defined in an array, and each entry of the array is a table of key-value pairs describing the element at that position.  Elements are rendered in the order in which they are assigned to the array (i.e. element 1 is drawn before element 2, etc.).\n\nAttributes for canvas elements are defined in [hs.canvas.attributes](#attributes). All canvas elements require the `type` field; all other attributes have default values.  Fields required to properly define the element (for example, `frame` for the `rectangle` element type) will be copied into the element definition with their default values if they are not specified at the time of creation. Optional attributes will only be assigned in the element definition if they are specified.  When the module requires the value for an element's attribute it first checks the element definition itself, then the defaults are looked for in the canvas defaults, and then finally in the module's built in defaults (specified in the descriptions below).\n\nSome examples of how to use this module can be found at https://github.com/asmagill/hammerspoon/wiki/hs.canvas.examples","def":"-> hs.canvas"},"chooser":{"type":"Module","doc":"Graphical, interactive tool for choosing/searching data\n\nNotes:\n * This module was influenced heavily by Choose, by Steven Degutis (https://github.com/sdegutis/choose)","def":"-> hs.chooser"},"console":{"type":"Module","doc":"Some functions for manipulating the Hammerspoon console.\n\nThese functions allow altering the behavior and display of the Hammerspoon console.  They should be considered experimental, but have worked well for me.","def":"-> hs.console"},"crash":{"type":"Module","doc":"Various features/facilities for developers who are working on Hammerspoon itself, or writing extensions for it. It is extremely unlikely that you should need any part of this extension, in a normal user configuration.","def":"-> hs.crash"},"deezer":{"type":"Module","doc":"Controls for Deezer music player.\n\nHeavily inspired by 'hs.spotify', credits to the original author.","def":"-> hs.deezer"},"dialog":{"type":"Module","doc":"A collection of useful dialog boxes, alerts and panels for user interaction.","def":"-> hs.dialog"},"distributednotifications":{"type":"Module","doc":"Interact with NSDistributedNotificationCenter\nThere are many notifications posted by parts of OS X, and third party apps, which may be interesting to react to using this module.\n\nYou can discover the notifications that are being posted on your system with some code like this:\n```\nfoo = hs.distributednotifications.new(function(name, object, userInfo) print(string.format(\"name: %s\\nobject: %s\\nuserInfo: %s\\n\", name, object, hs.inspect(userInfo))) end)\nfoo:start()\n```\n\nNote that distributed notifications are expensive - they involve lots of IPC. Also note that they are not guaranteed to be delivered, particularly if the system is very busy.","def":"-> hs.distributednotifications"},"doc":{"type":"Module","doc":"Create documentation objects for interactive help within Hammerspoon\n\nThe documentation object created is a table with tostring metamethods allowing access to a specific functions documentation by appending the path to the method or function to the object created.\n\nFrom the Hammerspoon console:\n\n      doc = require(\"hs.doc\")\n      doc.hs.application\n\nResults in:\n\n      Manipulate running applications\n\n      [submodules]\n      hs.application.watcher\n\n      [subitems]\n      hs.application:activate([allWindows]) -> bool\n      hs.application:allWindows() -> window[]\n          ...\n      hs.application:visibleWindows() -> win[]\n\nBy default, the internal core documentation and portions of the Lua 5.3 manual, located at http://www.lua.org/manual/5.3/manual.html, are already registered for inclusion within this documentation object, but you can register additional documentation from 3rd party modules with `hs.registerJSONFile(...)`.","def":"-> hs.doc"},"dockicon":{"type":"Module","doc":"Control Hammerspoon's dock icon\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.dockicon"},"drawing":{"type":"Module","doc":"DEPRECATED. Primitives for drawing on the screen in various ways.\n\nhs.drawing is now deprecated and will be removed in a future release. Its functionality is now implemented by hs.canvas and you should migrate your code to using that directly. The API docs for hs.drawing remain here as a convenience.","def":"-> hs.drawing"},"eventtap":{"type":"Module","doc":"Tap into input events (mouse, keyboard, trackpad) for observation and possibly overriding them\nIt also provides convenience wrappers for sending mouse and keyboard events. If you need to construct finely controlled mouse/keyboard events, see hs.eventtap.event\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.eventtap"},"expose":{"type":"Module","doc":"Keyboard-driven expose replacement/enhancement\n\nWarning: this module is still somewhat experimental.\nShould you encounter any issues, please feel free to report them on https://github.com/Hammerspoon/hammerspoon/issues\nor #hammerspoon on irc.libera.chat\n\nWith this module you can configure a hotkey to show thumbnails for open windows when invoked; each thumbnail will have\nan associated keyboard \"hint\" (usually one or two characters) that you can type to quickly switch focus to that\nwindow; in conjunction with keyboard modifiers, you can additionally minimize (`alt` by default) or close\n(`shift` by default) any window without having to focus it first.\n\nWhen used in combination with a windowfilter you can include or exclude specific apps, window titles, screens,\nwindow roles, etc. Additionally, each expose instance can be customized to include or exclude minimized or hidden windows,\nwindows residing in other Mission Control Spaces, or only windows for the current application. You can further customize\nhint length, colors, fonts and sizes, whether to show window thumbnails and/or titles, and more.\n\nTo improve responsiveness, this module will update its thumbnail layout in the background (so to speak), so that it\ncan show the expose without delay on invocation. Be aware that on particularly heavy Hammerspoon configurations\nthis could adversely affect overall performance; you can disable this behaviour with\n`hs.expose.ui.fitWindowsInBackground=false`\n\nUsage:\n```\n-- set up your instance(s)\nexpose = hs.expose.new(nil,{showThumbnails=false}) -- default windowfilter, no thumbnails\nexpose_app = hs.expose.new(nil,{onlyActiveApplication=true}) -- show windows for the current application\nexpose_space = hs.expose.new(nil,{includeOtherSpaces=false}) -- only windows in the current Mission Control Space\nexpose_browsers = hs.expose.new{'Safari','Google Chrome'} -- specialized expose using a custom windowfilter\n-- for your dozens of browser windows :)\n\n-- then bind to a hotkey\nhs.hotkey.bind('ctrl-cmd','e','Expose',function()expose:toggleShow()end)\nhs.hotkey.bind('ctrl-cmd-shift','e','App Expose',function()expose_app:toggleShow()end)\n```","def":"-> hs.expose"},"fnutils":{"type":"Module","doc":"Functional programming utility functions","def":"-> hs.fnutils"},"fs":{"type":"Module","doc":"Access/inspect the filesystem\n\nThis module is partial superset of LuaFileSystem 1.8.0 (http://keplerproject.github.io/luafilesystem/). It has been modified to remove functions which do not apply to macOS filesystems and additional functions providing macOS specific filesystem information have been added.","def":"-> hs.fs"},"geometry":{"type":"Module","doc":"Utility object to represent points, sizes and rects in a bidimensional plane\n\nAn hs.geometry object can be:\n * a *point*, or vector2, with `x` and `y` fields for its coordinates\n * a *size* with `w` and `h` fields for width and height respectively\n * a *rect*, which has both a point component for one of its corners, and a size component - so it has all 4 fields\n * a *unit rect*, which is a rect with all fields between 0 and 1; it represents a \"relative\" rect within another (absolute) rect\n   (e.g. a unit rect `x=0,y=0 , w=0.5,h=0.5` is the quarter portion closest to the origin); please note that hs.geometry\n   makes no distinction internally between regular rects and unit rects; you can convert to and from as needed via the appropriate methods\n\nYou can create these objects in many different ways, via `my_obj=hs.geometry.new(...)` or simply `my_obj=hs.geometry(...)`\nby passing any of the following:\n * 4 parameters `X,Y,W,H` for the respective fields - W and H, or X and Y, can be `nil`:\n   * `hs.geometry(X,Y)` creates a point\n   * `hs.geometry(nil,nil,W,H)` creates a size\n   * `hs.geometry(X,Y,W,H)` creates a rect given its width and height from a corner\n * a table `{X,Y}` creates a point\n * a table `{X,Y,W,H}` creates a rect\n * a table `{x=X,y=Y,w=W,h=H}` creates a rect, or if you omit X and Y, or W and H, creates a size or a point respectively\n * a table `{x1=X1,y1=Y1,x2=X2,y2=Y2}` creates a rect, where X1,Y1 and X2,Y2 are the coordinates of opposite corners\n * a string:\n   * `\"X Y\"` or `\"X,Y\"` creates a point\n   * `\"WxH\"` or `\"W*H\"` creates a size\n   * `\"X Y/WxH\"` or `\"X,Y W*H\"` (or variations thereof) creates a rect given its width and height from a corner\n   * `\"X1,Y1>X2,Y2\"` or `\"X1 Y1 X2 Y2\"` (or variations thereof) creates a rect given two opposite corners\n   * `\"[X,Y WxH]\"` or `\"[X1,Y1 X2,Y2]\"` or variations (note the square brackets) creates a unit rect where x=X/100, y=Y/100, w=W/100, h=H/100\n * a point and a size `\"X Y\",\"WxH\"` or `{x=X,y=Y},{w=W,h=H}` create a rect\n\nYou can use any of these anywhere an hs.geometry object is expected in Hammerspoon; the constructor will be called for you.","def":"-> hs.geometry"},"grid":{"type":"Module","doc":"Move/resize windows within a grid\n\nThe grid partitions your screens for the purposes of window management. The default layout of the grid is 3 columns by 3 rows.\nYou can specify different grid layouts for different screens and/or screen resolutions.\n\nWindows that are aligned with the grid have their location and size described as a `cell`. Each cell is an `hs.geometry` rect with these fields:\n * x - The column of the left edge of the window\n * y - The row of the top edge of the window\n * w - The number of columns the window occupies\n * h - The number of rows the window occupies\n\nFor a grid of 3x3:\n * a cell `'0,0 1x1'` will be in the upper-left corner\n * a cell `'2,0 1x1'` will be in the upper-right corner\n * and so on...\n\nAdditionally, a modal keyboard driven interface for interactive resizing is provided via `hs.grid.show()`;\nThe grid will be overlaid on the focused or frontmost window's screen with keyboard hints.\nTo resize/move the window, you can select the corner cells of the desired position.\nFor a move-only, you can select a cell and confirm with 'return'. The selected cell will become the new upper-left of the window.\nYou can also use the arrow keys to move the window onto adjacent screens, and the tab/shift-tab keys to cycle to the next/previous window.\nOnce you selected a cell, you can use the arrow keys to navigate through the grid. In this case, the grid will highlight the selected cells.\nAfter highlighting enough cells, press enter to move/resize the window to the highlighted area.","def":"-> hs.grid"},"hash":{"type":"Module","doc":"Various hashing algorithms","def":"-> hs.hash"},"hid":{"type":"Module","doc":"HID interface for Hammerspoon, controls and queries caps lock state\n\nPortions sourced from (https://discussions.apple.com/thread/7094207).","def":"-> hs.hid"},"hints":{"type":"Module","doc":"Switch focus with a transient per-application keyboard shortcut","def":"-> hs.hints"},"host":{"type":"Module","doc":"Inspect information about the machine Hammerspoon is running on\n\nNotes:\n * The network/hostname calls can be slow, as network resolution calls can be called, which are synchronous and will block Hammerspoon until they complete.","def":"-> hs.host"},"hotkey":{"type":"Module","doc":"Create and manage global keyboard shortcuts","def":"-> hs.hotkey"},"http":{"type":"Module","doc":"Perform HTTP requests","def":"-> hs.http"},"httpserver":{"type":"Module","doc":"Simple HTTP server\n\nNotes:\n * Running an HTTP server is potentially dangerous, you should seriously consider the security implications of exposing your Hammerspoon instance to a network - especially to the Internet\n * As a user of Hammerspoon, you are assumed to be highly capable, and aware of the security issues","def":"-> hs.httpserver"},"image":{"type":"Module","doc":"A module for capturing and manipulating image objects from other modules for use with hs.drawing.\n","def":"-> hs.image"},"inspect":{"type":"Module","doc":"Produce human-readable representations of Lua variables (particularly tables)\n\nThis extension is based on inspect.lua by Enrique García Cota\nhttps://github.com/kikito/inspect.lua","def":"-> hs.inspect"},"ipc":{"type":"Module","doc":"Provides Hammerspoon with the ability to create both local and remote message ports for inter-process communication.\n\nThe most common use of this module is to provide support for the command line tool `hs` which can be added to your terminal shell environment with [hs.ipc.cliInstall](#cliInstall).  The command line tool will not work unless the `hs.ipc` module is loaded first, so it is recommended that you add `require(\"hs.ipc\")` to your Hammerspoon `init.lua` file (usually located at ~/.hammerspoon/init.lua) so that it is always available when Hammerspoon is running.\n\nThis module is based heavily on code from Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.ipc"},"itunes":{"type":"Module","doc":"Controls for iTunes music player","def":"-> hs.itunes"},"javascript":{"type":"Module","doc":"Execute JavaScript code\n\nThis module has been replaced by: [hs.osascript.javascript](./hs.osascript.html#javascript)","def":"-> hs.javascript"},"json":{"type":"Module","doc":"JSON encoding and decoding\n\nThis module is based partially on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).\n","def":"-> hs.json"},"keycodes":{"type":"Module","doc":"Convert between key-strings and key-codes. Also provides functionality for querying and changing keyboard layouts.","def":"-> hs.keycodes"},"layout":{"type":"Module","doc":"Window layout manager\n\nThis extension allows you to trigger window placement/sizing to a number of windows at once","def":"-> hs.layout"},"location":{"type":"Module","doc":"Determine the machine's location and useful information about that location\n\nThis module provides functions for getting current location information and tracking location changes. It expands on the earlier version of the module by adding the ability to create independent locationObjects which can enable/disable location tracking independent of other uses of Location Services by Hammerspoon, adds region monitoring for exit and entry, and adds the retrieval of geocoding information through the `hs.location.geocoder` submodule.\n\nThis module is backwards compatible with its predecessor with the following changes:\n * [hs.location.get](#get) - no longer requires that you invoke [hs.location.start](#start) before using this function. The information returned will be the last cached value, which is updated internally whenever additional WiFi networks are detected or lost (not necessarily joined). When update tracking is enabled with the [hs.location.start](#start) function, calculations based upon the RSSI of all currently seen networks are preformed more often to provide a more precise fix, but it's still based on the WiFi networks near you. In many cases, the value retrieved when the WiFi state is changed should be sufficiently accurate.\n * [hs.location.servicesEnabled](#servicesEnabled) - replaces `hs.location.services_enabled`. While the earlier function is included for backwards compatibility, it will display a deprecation warning to the console the first time it is invoked and may go away completely in the future.\n\nThe following labels are used to describe tables which are used by functions and methods as parameters or return values in this module and in `hs.location.geocoder`. These tables are described as follows:\n\n * `locationTable` - a table specifying location coordinates containing one or more of the following key-value pairs:\n   * `latitude`           - a number specifying the latitude in degrees. Positive values indicate latitudes north of the equator. Negative values indicate latitudes south of the equator. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `longitude`          - a number specifying the longitude in degrees. Measurements are relative to the zero meridian, with positive values extending east of the meridian and negative values extending west of the meridian. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `altitude`           - a number indicating altitude above (positive) or below (negative) sea-level. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `horizontalAccuracy` - a number specifying the radius of uncertainty for the location, measured in meters. If negative, the `latitude` and `longitude` keys are invalid and should not be trusted. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `verticalAccuracy`   - a number specifying the accuracy of the altitude value in meters. If negative, the `altitude` key is invalid and should not be trusted. When not specified in a table being used as an argument, this defaults to -1.0.\n   * `course`             - a number specifying the direction in which the device is traveling. If this value is negative, then the value is invalid and should not be trusted. On current Macintosh models, this will almost always be a negative number. When not specified in a table being used as an argument, this defaults to -1.0.\n   * `speed`              - a number specifying the instantaneous speed of the device in meters per second. If this value is negative, then the value is invalid and should not be trusted. On current Macintosh models, this will almost always be a negative number. When not specified in a table being used as an argument, this defaults to -1.0.\n   * `timestamp`          - a number specifying the time at which this location was determined. This number is the number of seconds since January 1, 1970 at midnight, GMT, and is a floating point number, so you should use `math.floor` on this number before using it as an argument to Lua's `os.date` function. When not specified in a table being used as an argument, this defaults to the current time.\n\n * `regionTable` - a table specifying a circular region containing one or more of the following key-value pairs:\n   * `identifier`    - a string for use in identifying the region. When not specified in a table being used as an argument, a new value is generated with `hs.host.uuid`.\n   * `latitude`      - a number specifying the latitude in degrees. Positive values indicate latitudes north of the equator. Negative values indicate latitudes south of the equator. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `longitude`     - a number specifying the latitude in degrees. Positive values indicate latitudes north of the equator. Negative values indicate latitudes south of the equator. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `radius`        - a number specifying the radius (measured in meters) that defines the region’s outer boundary. When not specified in a table being used as an argument, this defaults to 0.0.\n   * `notifyOnEntry` - a boolean specifying whether or not a callback with the \"didEnterRegion\" message should be generated when the machine enters the region. When not specified in a table being used as an argument, this defaults to true.\n   * `notifyOnExit`  - a boolean specifying whether or not a callback with the \"didExitRegion\" message should be generated when the machine exits the region. When not specified in a table being used as an argument, this defaults to true.","def":"-> hs.location"},"logger":{"type":"Module","doc":"Simple logger for debugging purposes\n\nNote: \"methods\" in this module are actually \"static\" functions - see `hs.logger.new()`","def":"-> hs.logger"},"math":{"type":"Module","doc":"Various helpful mathematical functions\n\nThis module includes, and is a superset of the built-in Lua `math` library so it is safe to do something like the following in your own code and still have access to both libraries:\n\n    local math = require(\"hs.math\")\n    local n = math.sin(math.minFloat) -- works even though they're both from different libraries\n\nThe documentation for the math library can be found at http://www.lua.org/manual/5.3/ or from the Hammerspoon console via the help command: `help.lua.math`. This includes the following functions and variables:\n\n  * hs.math.abs        - help available via `help.lua.math.abs`\n  * hs.math.acos       - help available via `help.lua.math.acos`\n  * hs.math.asin       - help available via `help.lua.math.asin`\n  * hs.math.atan       - help available via `help.lua.math.atan`\n  * hs.math.ceil       - help available via `help.lua.math.ceil`\n  * hs.math.cos        - help available via `help.lua.math.cos`\n  * hs.math.deg        - help available via `help.lua.math.deg`\n  * hs.math.exp        - help available via `help.lua.math.exp`\n  * hs.math.floor      - help available via `help.lua.math.floor`\n  * hs.math.fmod       - help available via `help.lua.math.fmod`\n  * hs.math.huge       - help available via `help.lua.math.huge`\n  * hs.math.log        - help available via `help.lua.math.log`\n  * hs.math.max        - help available via `help.lua.math.max`\n  * hs.math.maxinteger - help available via `help.lua.math.maxinteger`\n  * hs.math.min        - help available via `help.lua.math.min`\n  * hs.math.mininteger - help available via `help.lua.math.mininteger`\n  * hs.math.modf       - help available via `help.lua.math.modf`\n  * hs.math.pi         - help available via `help.lua.math.pi`\n  * hs.math.rad        - help available via `help.lua.math.rad`\n  * hs.math.random     - help available via `help.lua.math.random`\n  * hs.math.randomseed - help available via `help.lua.math.randomseed`\n  * hs.math.sin        - help available via `help.lua.math.sin`\n  * hs.math.sqrt       - help available via `help.lua.math.sqrt`\n  * hs.math.tan        - help available via `help.lua.math.tan`\n  * hs.math.tointeger  - help available via `help.lua.math.tointeger`\n  * hs.math.type       - help available via `help.lua.math.type`\n  * hs.math.ult        - help available via `help.lua.math.ult`\n\nAdditional functions and values that are specific to Hammerspoon which provide expanded math support are documented here.","def":"-> hs.math"},"menubar":{"type":"Module","doc":"Create and manage menubar icons","def":"-> hs.menubar"},"messages":{"type":"Module","doc":"Send messages via iMessage and SMS Relay (note, SMS Relay requires OS X 10.10 and an established SMS Relay pairing between your Mac and an iPhone running iOS8)\n\nNote: This extension works by controlling the OS X \"Messages\" app via AppleScript, so you will need that app to be signed into an iMessage account","def":"-> hs.messages"},"midi":{"type":"Module","doc":"MIDI Extension for Hammerspoon.\n\nThis extension supports listening, transmitting and synthesizing MIDI commands.\n\nThis extension was thrown together by [Chris Hocking](http://latenitefilms.com) for [CommandPost](http://commandpost.io).\n\nThis extension uses [MIKMIDI](https://github.com/mixedinkey-opensource/MIKMIDI), an easy-to-use Objective-C MIDI library created by Andrew Madsen and developed by him and Chris Flesner of [Mixed In Key](http://www.mixedinkey.com/).\n\nMIKMIDI LICENSE:\nCopyright (c) 2013 Mixed In Key, LLC.\nOriginal author: [Andrew R. Madsen](https://github.com/armadsen) (andrew@mixedinkey.com)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.","def":"-> hs.midi"},"milight":{"type":"Module","doc":"Simple controls for the MiLight LED WiFi bridge (also known as LimitlessLED and EasyBulb)","def":"-> hs.milight"},"mjomatic":{"type":"Module","doc":"tmuxomatic-like window management","def":"-> hs.mjomatic"},"mouse":{"type":"Module","doc":"Inspect/manipulate the position of the mouse pointer\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).\n\nThis module uses ManyMouse by Ryan C. Gordon.\n\nMANYMOUSE LICENSE:\n\nCopyright (c) 2005-2012 Ryan C. Gordon and others.\n\nThis software is provided 'as-is', without any express or implied warranty.\nIn no event will the authors be held liable for any damages arising from\nthe use of this software.\n\nPermission is granted to anyone to use this software for any purpose,\nincluding commercial applications, and to alter it and redistribute it\nfreely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not\nclaim that you wrote the original software. If you use this software in a\nproduct, an acknowledgment in the product documentation would be\nappreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be\nmisrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\n    Ryan C. Gordon <icculus@icculus.org>","def":"-> hs.mouse"},"network":{"type":"Module","doc":"This module provides functions for inquiring about and monitoring changes to the network.","def":"-> hs.network"},"noises":{"type":"Module","doc":"Contains two low latency audio recognizers for different mouth noises, which can be used to trigger actions like scrolling or clicking.\nThe recognizers are also high accuracy and don't use much CPU time.\n\nThis module was written by [Tristan Hume](http://thume.ca/). If you have any issues with or questions about the recognition, email him.\nAll first person references in this module's documentation refer to him.\n\nThe detectors are tuned so that they work for most people and most microphones. For best results use a highly directional headset microphone so that it doesn't pick up other people and background\nnoises around you, and put the boom off to the side of your mouth so you aren't directly breathing on it.\n\nThe two mouth noises (and their corresponding event numbers) are:\n\n### \"sssssssssss\"\nThe \"sssss\" noise/syllable is easy to make and can be made continuously. The detector emits an event `1` when you start saying \"sss\" and a `2` after you stop.\nIt's good to hook up to variable-length actions like clicking/dragging and scrolling. It can detect very quiet noises so even just barely saying \"ssss\" under your\nbreath should trigger it without annoying anybody else around you too much. It works with most \"sss\" syllables but I find sharper is better, in crispness that is, loudness doesn't matter much.\nIt has a very low false negative rate, but often has false positives. It will obviously trigger in english speech since \"s\" is a common syllable, but with some microphones breathing in certain ways\nwill trigger it as well. Personally I use this to scroll down, it allows me to read long articles and books lying down with my laptop without awkward hand positioning to scroll with the trackpad.\n\n### Lip Popping\nPopping your lips is harder to do reliably and can't be done for variable lengths of time. The detector calls your callback with the number `3` when it detects one.\nThis detector has an almost zero false positive rate in my experience and a very low false negative rate (when you manage to make the sound).\nPersonally I use this to scroll up by a large increment in case I scroll down too far with \"sss\", and when my RSS reader is focused it moves to the next article.\nThe only false positives I've ever had with this detector are various rare throat clearing noises that make a pop sound very much like a lip pop.","def":"-> hs.noises"},"notify":{"type":"Module","doc":"This module allows you to create on screen notifications in the User Notification Center located at the right of the users screen.\n\nNotifications can be sent immediately or scheduled for delivery at a later time, even if that scheduled time occurs when Hammerspoon is not currently running. Currently, if you take action on a notification while Hammerspoon is not running, the callback function is not honored for the first notification clicked upon -- This is expected to be fixed in a future release.\n\nWhen setting up a callback function, you have the option of specifying it with the creation of the notification (hs.notify.new) or by pre-registering it with hs.notify.register and then referring it to by the tag name specified with hs.notify.register. If you use this registration method for defining your callback functions, and make sure to register all expected callback functions within your init.lua file or files it includes, then callback functions will remain available for existing notifications in the User Notification Center even if Hammerspoon's configuration is reloaded or if Hammerspoon is restarted. If the callback tag is not present when the user acts on the notification, the Hammerspoon console will be raised as a default action.\n\nA shorthand, based upon the original inspiration for this module from Hydra and Mjolnir, hs.notify.show, is provided if you just require a quick and simple informative notification without the bells and whistles.\n\nThis module is based in part on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.notify"},"osascript":{"type":"Module","doc":"Execute Open Scripting Architecture (OSA) code - AppleScript and JavaScript\n","def":"-> hs.osascript"},"pasteboard":{"type":"Module","doc":"Inspect/manipulate pasteboards (more commonly called clipboards). Both the system default pasteboard and custom named pasteboards can be interacted with.\n\nThis module is based partially on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.pasteboard"},"pathwatcher":{"type":"Module","doc":"Watch paths recursively for changes\n\nThis simple example watches your Hammerspoon directory for changes, and when it sees a change, reloads your configs:\n\n    local myWatcher = hs.pathwatcher.new(os.getenv(\"HOME\") .. \"/.hammerspoon/\", hs.reload):start()\n\nThis module is based primarily on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).","def":"-> hs.pathwatcher"},"plist":{"type":"Module","doc":"Read and write Property List files","def":"-> hs.plist"},"razer":{"type":"Module","doc":"Razer device support.\n\nThis extension currently only supports the Razer Tartarus V2.\nIt allows you to trigger callbacks when you press buttons and use the\nscroll wheel, as well as allowing you to change the LED backlights\non the buttons and scroll wheel, and control the three status lights.\n\nBy default, the Razer Tartarus V2 triggers regular keyboard commands\n(i.e. pressing the \"01\" key will type \"1\"). However, you can use the\n`:defaultKeyboardLayout(false)` method to prevent this. This works by\nremapping the default shortcut keys to \"dummy\" keys, so that they\ndon't trigger regular keypresses in macOS.\n\nLike the [`hs.streamdeck`](http://www.hammerspoon.org/docs/hs.streamdeck.html) extension, this extension has been\ndesigned to be modular, so it's possible for others to develop support\nfor other Razer devices later down the line, if there's interest.\n\nThis extension was thrown together by [Chris Hocking](https://github.com/latenitefilms) for [CommandPost](https://commandpost.io).\n\nThis extension is based off the [`hs.streamdeck`](http://www.hammerspoon.org/docs/hs.streamdeck.html) extension by [Chris Jones](https://github.com/cmsj).\n\nSpecial thanks to the authors of these awesome documents & resources:\n\n - [Information on USB Packets](https://www.beyondlogic.org/usbnutshell/usb6.shtml)\n - [AppleUSBDefinitions.h](https://lab.qaq.wiki/Lakr233/IOKit-deploy/-/blob/master/IOKit/usb/AppleUSBDefinitions.h)\n - [hidutil key remapping generator for macOS](https://hidutil-generator.netlify.app)\n - [macOS function key remapping with hidutil](https://www.nanoant.com/mac/macos-function-key-remapping-with-hidutil)\n - [HID Device Property Keys](https://developer.apple.com/documentation/iokit/iohidkeys_h_user-space/hid_device_property_keys)","def":"-> hs.razer"},"redshift":{"type":"Module","doc":"Inverts and/or lowers the color temperature of the screen(s) on a schedule, for a more pleasant experience at night\n\nUsage:\n```\n-- make a windowfilterDisable for redshift: VLC, Photos and screensaver/login window will disable color adjustment and inversion\nlocal wfRedshift=hs.window.filter.new({VLC={focused=true},Photos={focused=true},loginwindow={visible=true,allowRoles='*'}},'wf-redshift')\n-- start redshift: 2800K + inverted from 21 to 7, very long transition duration (19->23 and 5->9)\nhs.redshift.start(2800,'21:00','7:00','4h',true,wfRedshift)\n-- allow manual control of inverted colors\nhs.hotkey.bind(HYPER,'f1','Invert',hs.redshift.toggleInvert)\n```\n\nNote:\n * As of macOS 10.12.4, Apple provides \"Night Shift\", which implements a simple red-shift effect, as part of the OS. It seems unlikely that `hs.redshift` will see significant future development.","def":"-> hs.redshift"},"screen":{"type":"Module","doc":"Manipulate screens (i.e. monitors)\n\nThe macOS coordinate system used by Hammerspoon assumes a grid that spans all the screens (positioned as per\nSystem Preferences->Displays->Arrangement). The origin `0,0` is at the top left corner of the *primary screen*.\n(Screens to the left of the primary screen, or above it, and windows on these screens, will have negative coordinates)","def":"-> hs.screen"},"serial":{"type":"Module","doc":"Communicate with external devices through a serial port (most commonly RS-232).\n\nPowered by ORSSerialPort. Thrown together by @latenitefilms.\n\nCopyright (c) 2011-2012 Andrew R. Madsen (andrew@openreelsoftware.com)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.","def":"-> hs.serial"},"settings":{"type":"Module","doc":"Serialize simple Lua variables across Hammerspoon launches\nSettings must have a string key and must be made up of serializable Lua objects (string, number, boolean, nil, tables of such, etc.)\n\nThis module is based partially on code from the previous incarnation of Mjolnir by [Steven Degutis](https://github.com/sdegutis/).\n","def":"-> hs.settings"},"sharing":{"type":"Module","doc":"Share items with the macOS Sharing Services under the control of Hammerspoon.\n\nThis module will allow you to share Hammerspoon items with registered Sharing Services.  Some of the built-in sharing services include sharing through mail, Facebook, AirDrop, etc.  Other applications can add additional services as well.\n\nFor most sharing services (this has not been tested with all), the user will be prompted with the standard sharing dialog showing what is to be shared and offered a chance to submit or cancel.\n\nThis example prepares an email with a screenshot:\n~~~lua\nmailer = hs.sharing.newShare(\"com.apple.share.Mail.compose\")\nmailer:subject(\"Screenshot generated at \" .. os.date()):recipients({ \"user@address.com\" })\nmailer:shareItems({ [[\n    Add any notes that you wish to add describing the screenshot here and click the Send icon when you are ready to send this\n\n]], hs.screen.mainScreen():snapshot() })\n~~~\n\nCommon item data types that can be shared with Sharing Services include (but are not necessarily limited to):\n * basic data types like strings and numbers\n * hs.image objects\n * hs.styledtext objects\n * web sites and other URLs through the use of the [hs.sharing.URL](#URL) function\n * local files through the use of file URLs created with the [hs.sharing.fileURL](#fileURL) function","def":"-> hs.sharing"},"shortcuts":{"type":"Module","doc":"List and run shortcuts from the Shortcuts app\n\nSeparate from this extension, Hammerspoon provides an action for use in the Shortcuts app.\nThe action is called \"Execute Lua\" and if it is passed a text block of valid Lua, it will execute that Lua within Hammerspoon.\nYou can use this action to call functions defined in your `init.lua` or to just execute chunks of Lua.\n\nYour functions/chunks can return text, which will be returned by the action in Shortcuts.","def":"-> hs.shortcuts"},"socket":{"type":"Module","doc":"Talk to custom protocols using asynchronous TCP sockets.\n\nFor UDP sockets see [`hs.socket.udp`](./hs.socket.udp.html).\n\n`hs.socket` is implemented with [CocoaAsyncSocket](https://github.com/robbiehanson/CocoaAsyncSocket). CocoaAsyncSocket's [tagging features](https://github.com/robbiehanson/CocoaAsyncSocket/wiki/Intro_GCDAsyncSocket#reading--writing) provide a handy way to implement custom protocols.\n\nFor example, you can easily implement a basic HTTP client as follows (though using [`hs.http`](./hs.http.html) is recommended for the real world):\n\n```lua\nlocal TAG_HTTP_HEADER, TAG_HTTP_CONTENT = 1, 2\nlocal body = \"\"\nlocal function httpCallback(data, tag)\n  if tag == TAG_HTTP_HEADER then\n    print(tag, \"TAG_HTTP_HEADER\"); print(data)\n    local contentLength = data:match(\"\\r\\nContent%-Length: (%d+)\\r\\n\")\n    client:read(tonumber(contentLength), TAG_HTTP_CONTENT)\n  elseif tag == TAG_HTTP_CONTENT then\n    print(tag, \"TAG_HTTP_CONTENT\"); print(data)\n    body = data\n  end\nend\n\nclient = hs.socket.new(httpCallback):connect(\"google.com\", 80)\nclient:write(\"GET /index.html HTTP/1.0\\r\\nHost: google.com\\r\\n\\r\\n\")\nclient:read(\"\\r\\n\\r\\n\", TAG_HTTP_HEADER)\n```\n\nResulting in the following console output (adjust log verbosity with `hs.socket.setLogLevel()`) :\n\n```\n            LuaSkin: (secondary thread): TCP socket connected\n            LuaSkin: (secondary thread): Data written to TCP socket\n            LuaSkin: (secondary thread): Data read from TCP socket\n1 TAG_HTTP_HEADER\nHTTP/1.0 301 Moved Permanently\nLocation: http://www.google.com/index.html\nContent-Type: text/html; charset=UTF-8\nDate: Thu, 03 Mar 2016 08:38:02 GMT\nExpires: Sat, 02 Apr 2016 08:38:02 GMT\nCache-Control: public, max-age=2592000\nServer: gws\nContent-Length: 229\nX-XSS-Protection: 1; mode=block\nX-Frame-Options: SAMEORIGIN\n\n            LuaSkin: (secondary thread): Data read from TCP socket\n2 TAG_HTTP_CONTENT\n&lt;HTML&gt;&lt;HEAD&gt;&lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html;charset=utf-8&quot;&gt;\n&lt;TITLE&gt;301 Moved&lt;/TITLE&gt;&lt;/HEAD&gt;&lt;BODY&gt;\n&lt;H1&gt;301 Moved&lt;/H1&gt;\nThe document has moved\n&lt;A HREF=&quot;http://www.google.com/index.html&quot;&gt;here&lt;/A&gt;.\n&lt;/BODY&gt;&lt;/HTML&gt;\n            LuaSkin: (secondary thread): TCP socket disconnected Socket closed by remote peer\n```\n\n","def":"-> hs.socket"},"sound":{"type":"Module","doc":"Load/play/manipulate sound files","def":"-> hs.sound"},"spaces":{"type":"Module","doc":"This module provides some basic functions for controlling macOS Spaces.\n\nThe functionality provided by this module is considered experimental and subject to change. By using a combination of private APIs and Accessibility hacks (via hs.axuielement), some basic functions for controlling the use of Spaces is possible with Hammerspoon, but there are some limitations and caveats.\n\nIt should be noted that while the functions provided by this module have worked for some time in third party applications and in a previous experimental module that has received limited testing over the last few years, they do utilize some private APIs which means that Apple could change them at any time.\n\nThe functions which allow you to create new spaes, remove spaces, and jump to a specific space utilize `hs.axuielement` and perform accessibility actions through the Dock application to manipulate Mission Control. Because we are essentially directing the Dock to perform User Interactions, there is some visual feedback which we cannot entirely suppress. You can minimize, but not entirely remove, this by enabling \"Reduce motion\" in System Preferences -> Accessibility -> Display.\n\nIt is recommended that you also enable \"Displays have separate Spaces\" in System Preferences -> Mission Control.\n\nThis module is a distillation of my previous `hs._asm.undocumented.spaces` module, changes inspired by reviewing the `Yabai` source, and some experimentation with `hs.axuielement`. If you require more sophisticated control, I encourage you to check out https://github.com/koekeishiya/yabai -- it does require some additional setup (changes to SIP, possibly edits to `sudoers`, etc.) but may be worth the extra steps for some power users.","def":"-> hs.spaces"},"speech":{"type":"Module","doc":"This module provides access to the Speech Synthesizer component of OS X.\n\nThe speech synthesizer functions and methods provide access to OS X's Text-To-Speech capabilities and facilitates generating speech output both to the currently active audio device and to an AIFF file.\n\nA discussion concerning the embedding of commands into the text to be spoken can be found at https://developer.apple.com/library/mac/documentation/UserExperience/Conceptual/SpeechSynthesisProgrammingGuide/FineTuning/FineTuning.html#//apple_ref/doc/uid/TP40004365-CH5-SW6.  It is somewhat dated and specific to the older MacinTalk style voices, but still contains some information relevant to the more modern higher quality voices as well in its discussion about embedded commands.","def":"-> hs.speech"},"spoons":{"type":"Module","doc":"Utility and management functions for Spoons\nSpoons are Lua plugins for Hammerspoon.\nSee https://www.hammerspoon.org/Spoons/ for more information","def":"-> hs.spoons"},"spotify":{"type":"Module","doc":"Controls for Spotify music player","def":"-> hs.spotify"},"spotlight":{"type":"Module","doc":"This module allows Hammerspoon to preform Spotlight metadata queries.\n\nThis module will only be able to perform queries on volumes and folders which are not blocked by the Privacy settings in the System Preferences Spotlight panel.\n\nA Spotlight query consists of two phases: an initial gathering phase where information currently in the Spotlight database is collected and returned, and a live-update phase which occurs after the gathering phase and consists of changes made to the Spotlight database, such as new entries being added, information in existing entries changing, or entities being removed.\n\nThe syntax for Spotlight Queries is beyond the scope of this module's documentation. It is a subset of the syntax supported by the Objective-C NSPredicate class.  Some references for this syntax can be found at:\n   * https://developer.apple.com/library/content/documentation/Carbon/Conceptual/SpotlightQuery/Concepts/QueryFormat.html\n   * https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/Predicates/Articles/pSyntax.html\n\nDepending upon the callback messages enabled with the [hs.spotlight:callbackMessages](#callbackMessages) method, your callback assigned with the [hs.spotlight:setCallback](#setCallback) method, you can determine the query phase by noting which messages you have received.  During the initial gathering phase, the following callback messages may be observed: \"didStart\", \"inProgress\", and \"didFinish\".  Once the initial gathering phase has completed, you will only observe \"didUpdate\" messages until the query is stopped with the [hs.spotlight:stop](#stop) method.\n\nYou can also check to see if the initial gathering phase is in progress with the [hs.spotlight:isGathering](#isGathering) method.\n\nYou can access the individual results of the query with the [hs.spotlight:resultAtIndex](#resultAtIndex) method. For convenience, metamethods have been added to the spotlightObject which make accessing individual results easier:  an individual spotlightItemObject may be accessed from a spotlightObject by treating the spotlightObject like an array; e.g. `spotlightObject[n]` will access the n'th spotlightItemObject in the current results.","def":"-> hs.spotlight"},"sqlite3":{"type":"Module","doc":"Interact with SQLite databases\n\nNotes:\n * This module is LSQLite 0.9.5 as found at http://lua.sqlite.org/index.cgi/index\n * It is unmodified apart from removing `db:load_extension()` as this feature is not available in Apple's libsqlite3.dylib\n * For API documentation please see [http://lua.sqlite.org](http://lua.sqlite.org)","def":"-> hs.sqlite3"},"streamdeck":{"type":"Module","doc":"Configure/control an Elgato Stream Deck.\n\nPlease note that in order for this module to work, the official Elgato Stream Deck app should not be running.\n\nThis extension supports the following devices:\n * Stream Deck (Original)\n * Stream Deck (Original V2)\n * Stream Deck Plus\n * Stream Deck Mini\n * Stream Deck Mini (V2)\n * Stream Deck XL\n * Stream Deck XL (Mk2)\n * Stream Deck Pedal\n\nThis module would not have been possible without standing on the shoulders of others:\n * https://github.com/OpenStreamDeck/StreamDeckSharp\n * https://github.com/Lange/node-elgato-stream-deck\n * Hopper","def":"-> hs.streamdeck"},"styledtext":{"type":"Module","doc":"This module adds support for controlling the style of the text in Hammerspoon.\n\nMore detailed documentation is being worked on and will be provided in the Hammerspoon Wiki at https://github.com/Hammerspoon/hammerspoon/wiki.  The documentation here is a condensed version provided for use within the Hammerspoon Dash docset and the inline help provided by the `help` console command within Hammerspoon.\n\nThe following list of attributes key-value pairs are recognized by this module and can be adjusted, set, or removed for objects by the various methods provided by this module.  The list of attributes is provided here for reference; anywhere in the documentation you see a reference to the `attributes key-value pairs`, refer back to here for specifics:\n\n* `font`               - A table containing the font name and size, specified by the keys `name` and `size`.  Default is the System Font at 27 points for `hs.drawing` text objects; otherwise the default is Helvetica at 12 points.  You may also specify this as a string, which will be taken as the font named in the string at the default size, when setting this attribute.\n* `color`              - A table indicating the color of the text as described in `hs.drawing.color`.  Default is white for hs.drawing text objects; otherwise the default is black.\n* `backgroundColor`    - Default nil, no background color (transparent).\n* `underlineColor`     - Default nil, same as `color`.\n* `strikethroughColor` - Default nil, same as `color`.\n* `strokeColor`        - Default nil, same as `color`.\n* `strokeWidth`        - Default 0, no stroke; positive, stroke alone; negative, stroke and fill (a typical value for outlined text would be 3.0)\n* `paragraphStyle`     - A table containing the paragraph style.  This table may contain any number of the following keys:\n    * `alignment`                     - A string indicating the texts alignment.  The string may contain a value of \"left\", \"right\", \"center\", \"justified\", or \"natural\". Default is \"natural\".\n    * `lineBreak`                     - A string indicating how text that doesn't fit into the drawingObjects rectangle should be handled.  The string may be one of \"wordWrap\", \"charWrap\", \"clip\", \"truncateHead\", \"truncateTail\", or \"truncateMiddle\".  Default is \"wordWrap\".\n    * `baseWritingDirection`          - A string indicating the base writing direction for the lines of text.  The string may be one of \"natural\", \"leftToRight\", or \"rightToLeft\".  Default is \"natural\".\n    * `tabStops`                      - An array of defined tab stops.  Default is an array of 12 left justified tab stops 28 points apart.  Each element of the array may contain the following keys:\n        * `location`                      - A floating point number indicating the number of points the tab stap is located from the line's starting margin (see baseWritingDirection).\n        * `tabStopType`                   - A string indicating the type of the tab stop: \"left\", \"right\", \"center\", or \"decimal\"\n    * `defaultTabInterval`            - A positive floating point number specifying the default tab stop distance in points after the last assigned stop in the tabStops field.\n    * `firstLineHeadIndent`           - A positive floating point number specifying the distance, in points, from the leading margin of a frame to the beginning of the paragraph's first line.  Default 0.0.\n    * `headIndent`                    - A positive floating point number specifying the distance, in points, from the leading margin of a text container to the beginning of lines other than the first.  Default 0.0.\n    * `tailIndent`                    - A floating point number specifying the distance, in points, from the margin of a frame to the end of lines. If positive, this value is the distance from the leading margin (for example, the left margin in left-to-right text). If 0 or negative, it's the distance from the trailing margin.  Default 0.0.\n    * `maximumLineHeight`             - A positive floating point number specifying the maximum height that any line in the frame will occupy, regardless of the font size. Glyphs exceeding this height will overlap neighboring lines. A maximum height of 0 implies no line height limit. Default 0.0.\n    * `minimumLineHeight`             - A positive floating point number specifying the minimum height that any line in the frame will occupy, regardless of the font size.  Default 0.0.\n    * `lineSpacing`                   - A positive floating point number specifying the space in points added between lines within the paragraph (commonly known as leading). Default 0.0.\n    * `paragraphSpacing`              - A positive floating point number specifying the space added at the end of the paragraph to separate it from the following paragraph.  Default 0.0.\n    * `paragraphSpacingBefore`        - A positive floating point number specifying the distance between the paragraph's top and the beginning of its text content.  Default 0.0.\n    * `lineHeightMultiple`            - A positive floating point number specifying the line height multiple. The natural line height of the receiver is multiplied by this factor (if not 0) before being constrained by minimum and maximum line height.  Default 0.0.\n    * `hyphenationFactor`             - The hyphenation factor, a value ranging from 0.0 to 1.0 that controls when hyphenation is attempted. By default, the value is 0.0, meaning hyphenation is off. A factor of 1.0 causes hyphenation to be attempted always.\n    * `tighteningFactorForTruncation` - A floating point number.  When the line break mode specifies truncation, the system attempts to tighten inter character spacing as an alternative to truncation, provided that the ratio of the text width to the line fragment width does not exceed 1.0 + the value of tighteningFactorForTruncation. Otherwise the text is truncated at a location determined by the line break mode. The default value is 0.05.\n    * `allowsTighteningForTruncation` - A boolean indicating whether the system may tighten inter-character spacing before truncating text. Only available in macOS 10.11 or newer. Default true.\n    * `headerLevel`                   - An integer number from 0 to 6 inclusive which specifies whether the paragraph is to be treated as a header, and at what level, for purposes of HTML generation.  Defaults to 0.\n* `superscript`        - An integer indicating if the text is to be displayed as a superscript (positive) or a subscript (negative) or normal (0).\n* `ligature`           - An integer. Default 1, standard ligatures; 0, no ligatures; 2, all ligatures.\n* `strikethroughStyle` - An integer representing the strike-through line style.  See `hs.styledtext.lineStyles`, `hs.styledtext.linePatterns` and `hs.styledtext.lineAppliesTo`.\n* `underlineStyle`     - An integer representing the underline style.  See `hs.styledtext.lineStyles`, `hs.styledtext.linePatterns` and `hs.styledtext.lineAppliesTo`.\n* `baselineOffset`     - A floating point value, as points offset from baseline. Default 0.0.\n* `kerning`            - A floating point value, as points by which to modify default kerning.  Default nil to use default kerning specified in font file; 0.0, kerning off; non-zero, points by which to modify default kerning.\n* `obliqueness`        - A floating point value, as skew to be applied to glyphs.  Default 0.0, no skew.\n* `expansion`          - A floating point value, as log of expansion factor to be applied to glyphs.  Default 0.0, no expansion.\n* `shadow`             - Default nil, indicating no drop shadow.  A table describing the drop shadow effect for the text.  The table may contain any of the following keys:\n    * `offset`             - A table with `h` and `w` keys (a size structure) which specify horizontal and vertical offsets respectively for the shadow.  Positive values always extend down and to the right from the user's perspective.\n    * `blurRadius`         - A floating point value specifying the shadow's blur radius.  A value of 0 indicates no blur, while larger values produce correspondingly larger blurring. The default value is 0.\n    * `color`              - The default shadow color is black with an alpha of 1/3. If you set this property to nil, the shadow is not drawn.\n\nTo make the `hs.styledtext` objects easier to use, in addition to the module specific functions and methods defined, some of the Lua String library has been reproduced to perform similar functions on these objects.  See the help section for each method for more information on their use:\n\n* `hs.styledtext:byte`\n* `hs.styledtext:find`\n* `hs.styledtext:gmatch`\n* `hs.styledtext:len`\n* `hs.styledtext:lower`\n* `hs.styledtext:match`\n* `hs.styledtext:rep`\n* `hs.styledtext:sub`\n* `hs.styledtext:upper`\n\nIn addition, the following metamethods have been included:\n\n* concat:\n    * `string`..`object` yields the string values concatenated\n    * `object`..`string` yields a new `hs.styledtext` object with `string` appended\n    * two `hs.styledtext` objects yields a new `hs.styledtext` object containing the concatenation of the two objects\n* len:     #object yields the length of the text contained in the object\n* eq:      object ==/~= object yields a boolean indicating if the text of the two objects is equal or not.  Use `hs.styledtext:isIdentical` if you need to compare attributes as well.\n* lt, le:  allows &lt;, &gt;, &lt;=, and &gt;= comparisons between objects and strings in which the text of an object is compared with the text of another or a Lua string.\n\nNote that due to differences in the way Lua determines when to use metamethods for equality comparisons versus relative-position comparisons, ==/~= cannot compare an object to a Lua string (it will always return false because the types are different).  You must use object:getString() ==/~= `string`.  (see `hs.styledtext:getString`)","def":"-> hs.styledtext"},"tabs":{"type":"Module","doc":"Place the windows of an application into tabs drawn on its titlebar","def":"-> hs.tabs"},"tangent":{"type":"Module","doc":"Tangent Control Surface Extension\n\n**API Version:** TUBE Version 3.2 - TIPC Rev 4 (22nd February 2017)\n\nThis plugin allows Hammerspoon to communicate with Tangent's range of panels, such as their Element, Virtual Element Apps, Wave, Ripple and any future panels.\n\nThe Tangent Unified Bridge Engine (TUBE) is made up of two software elements, the Mapper and the Hub. The Hub communicates with your application via the\nTUBE Inter Process Communications (TIPC). TIPC is a standardised protocol to allow any application that supports it to communicate with any current and\nfuture panels produced by Tangent via the TUBE Hub.\n\nYou can download the Tangent Developer Support Pack & Tangent Hub Installer for Mac [here](http://www.tangentwave.co.uk/developer-support/).\n\nThis extension was thrown together by [Chris Hocking](https://github.com/latenitefilms), then dramatically improved by [David Peterson](https://github.com/randomeizer) for [CommandPost](http://commandpost.io).","def":"-> hs.tangent"},"task":{"type":"Module","doc":"Execute processes in the background and capture their output\n\nNotes:\n * This is not intended to be used for processes which never exit. While it is possible to run such things with hs.task, it is not possible to read their output while they run and if they produce significant output, eventually the internal OS buffers will fill up and the task will be suspended.\n * An hs.task object can only be used once","def":"-> hs.task"},"timer":{"type":"Module","doc":"Execute functions with various timing rules\n\n**NOTE**: timers use NSTimer internally, which will be paused when computers sleep.\nEspecially, repeating timers won't be triggered at the specified time when there are sleeps in between.\nThe workaround is to prevent system from sleeping, configured in Energy Saver in System Preferences.","def":"-> hs.timer"},"uielement":{"type":"Module","doc":"A generalized framework for working with OSX UI elements","def":"-> hs.uielement"},"urlevent":{"type":"Module","doc":"Allows Hammerspoon to respond to URLs\nHammerspoon is configured to react to URLs that start with `hammerspoon://` when they are opened by OS X.\nThis extension allows you to register callbacks for these URL events and their parameters, offering a flexible way to receive events from other applications.\n\nYou can also choose to make Hammerspoon the default for `http://` and `https://` URLs, which lets you route the URLs in your Lua code\n\nGiven a URL such as `hammerspoon://someEventToHandle?someParam=things&otherParam=stuff`, in the literal, RFC1808 sense of the URL, `someEventToHandle` is the hostname (or net_loc) of the URL, but given that these are not network resources, we consider `someEventToHandle` to be the name of the event. No path should be specified in the URL - it should consist purely of a hostname and, optionally, query parameters.\n\nSee also `hs.ipc` for a command line IPC mechanism that is likely more appropriate for shell scripts or command line use. Unlike `hs.ipc`, `hs.urlevent` is not able to return any data to its caller.\n\nNOTE: If Hammerspoon is not running when a `hammerspoon://` URL is opened, Hammerspoon will be launched, but it will not react to the URL event. Nor will it react to any events until this extension is loaded and event callbacks have been bound.\nNOTE: Any event which is received, for which no callback has been bound, will be logged to the Hammerspoon Console\nNOTE: When you trigger a URL from another application, it is usually best to have the URL open in the background, if that option is available. Otherwise, OS X will activate Hammerspoon (i.e. give it focus), which makes URL events difficult to use for things like window management.","def":"-> hs.urlevent"},"usb":{"type":"Module","doc":"Inspect USB devices","def":"-> hs.usb"},"utf8":{"type":"Module","doc":"Functions providing basic support for UTF-8 encodings\n\nPrior to upgrading Hammerspoon's Lua interpreter to 5.3, UTF8 support was provided by including the then beta version of Lua 5.3's utf8 library as a Hammerspoon module.  This is no longer necessary, but to maintain compatibility, the Lua utf8 library can still be accessed through `hs.utf8`.  The documentation for the utf8 library can be found at http://www.lua.org/manual/5.3/ or from the Hammerspoon console via the help command: `help.lua.utf8`. This affects the following functions and variables:\n\n  * hs.utf8.char          - help available via `help.lua.utf8.char`\n  * hs.utf8.charPattern   - help available via `help.lua.utf8.charpattern`\n  * hs.utf8.codepoint     - help available via `help.lua.utf8.codepoint`\n  * hs.utf8.codes         - help available via `help.lua.utf8.codes`\n  * hs.utf8.len           - help available via `help.lua.utf8.len`\n  * hs.utf8.offset        - help available via `help.lua.utf8.offset`\n\nAdditional functions that are specific to Hammerspoon which provide expanded support for UTF8 are documented here.\n","def":"-> hs.utf8"},"vox":{"type":"Module","doc":"Controls for VOX music player","def":"-> hs.vox"},"watchable":{"type":"Module","doc":"A minimalistic Key-Value-Observer framework for Lua.\n\nThis module allows you to generate a table with a defined label or path that can be used to share data with other modules or code.  Other modules can register as watchers to a specific key-value pair within the watchable object table and will be automatically notified when the key-value pair changes.\n\nThe goal is to provide a mechanism for sharing state information between separate and (mostly) unrelated code easily and in an independent fashion.","def":"-> hs.watchable"},"websocket":{"type":"Module","doc":"Simple websocket client.","def":"-> hs.websocket"},"webview":{"type":"Module","doc":"Display web content in a window from Hammerspoon\n\nThis module uses Apple's WebKit WKWebView class to provide web content display with JavaScript injection support.  The objective is to provide a functional interface to the WKWebView and WKUserContentController classes.\n\nThis module is not intended to replace a full web browser and does have some limitations to keep in mind:\n  * Self-signed SSL certificates are not accepted unless they have first been approved and included in the users Keychain by another method, for example, opening the page first in Safari.\n  * The context-menu (right clicking or ctrl-clicking in the webview) provides some menu items which are currently unsupported -- a known example of this is any \"Download...\" menu item in the context menu for links and images.\n  * It is uncertain at present exactly how or where cookies and cached page data is stored or how it can be invalidated.\n    * This can be mitigated to an extent for web requests by using `hs.webview:reload(true)` and by crafting the url for `hs.webview:url({...})` as a table -- see the appropriate help entries for more information.\n\nAny suggestions or updates to the code to address any of these or other limitations as they may become apparent are welcome at the Hammerspoon github site: https://www.github.com/Hammerspoon/hammerspoon\n","def":"-> hs.webview"},"wifi":{"type":"Module","doc":"Inspect WiFi networks","def":"-> hs.wifi"},"window":{"type":"Module","doc":"Inspect/manipulate windows\n\nNotes:\n * See `hs.screen` and `hs.geometry` for more information on how Hammerspoon uses window/screen frames and coordinates","def":"-> hs.window"},"accessibilityState":{"def":"hs.accessibilityState(shouldPrompt) -> isEnabled","desc":"Checks the Accessibility Permissions for Hammerspoon, and optionally allows you to prompt for permissions.","doc":"Checks the Accessibility Permissions for Hammerspoon, and optionally allows you to prompt for permissions.\n\nParameters:\n * shouldPrompt - an optional boolean value indicating if the dialog box asking if the System Preferences application should be opened should be presented when Accessibility is not currently enabled for Hammerspoon.  Defaults to false.\n\nReturns:\n * True or False indicating whether or not Accessibility is enabled for Hammerspoon.\n\nNotes:\n * Since this check is done automatically when Hammerspoon loads, it is probably of limited use except for skipping things that are known to fail when Accessibility is not enabled.  Evettaps which try to capture keyUp and keyDown events, for example, will fail until Accessibility is enabled and the Hammerspoon application is relaunched.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"274","name":"accessibilityState","notes":[" * Since this check is done automatically when Hammerspoon loads, it is probably of limited use except for skipping things that are known to fail when Accessibility is not enabled.  Evettaps which try to capture keyUp and keyDown events, for example, will fail until Accessibility is enabled and the Hammerspoon application is relaunched."],"parameters":[" * shouldPrompt - an optional boolean value indicating if the dialog box asking if the System Preferences application should be opened should be presented when Accessibility is not currently enabled for Hammerspoon.  Defaults to false."],"returns":[" * True or False indicating whether or not Accessibility is enabled for Hammerspoon."],"signature":"hs.accessibilityState(shouldPrompt) -> isEnabled","stripped_doc":"","type":"Function"},"accessibilityStateCallback":{"def":"hs.accessibilityStateCallback","desc":"An optional function that will be called when the Accessibility State is changed.","doc":"An optional function that will be called when the Accessibility State is changed.\n\nNotes:\n * The function will not receive any arguments when called.  To check what the accessibility state has been changed to, you should call [hs.accessibilityState](#accessibilityState) from within your function.","file":"extensions/_coresetup/_coresetup.lua","lineno":"66","name":"accessibilityStateCallback","notes":[" * The function will not receive any arguments when called.  To check what the accessibility state has been changed to, you should call [hs.accessibilityState](#accessibilityState) from within your function."],"signature":"hs.accessibilityStateCallback","stripped_doc":"","type":"Variable"},"allowAppleScript":{"def":"hs.allowAppleScript([state]) -> bool","desc":"Set or display whether or not external Hammerspoon AppleScript commands are allowed.","doc":"Set or display whether or not external Hammerspoon AppleScript commands are allowed.\n\nParameters:\n * state - an optional boolean which will set whether or not external Hammerspoon's AppleScript commands are allowed.\n\nReturns:\n * A boolean, `true` if Hammerspoon's AppleScript commands are (or has just been) allowed, otherwise `false`.\n\nNotes:\n * AppleScript access is disallowed by default.\n * However due to the way AppleScript support works, Hammerspoon will always allow AppleScript commands that are part of the \"Standard Suite\", such as `name`, `quit`, `version`, etc. However, Hammerspoon will only allow commands from the \"Hammerspoon Suite\" if `hs.allowAppleScript()` is set to `true`.\n * For a full list of AppleScript Commands:\n     - Open `/Applications/Utilities/Script Editor.app`\n     - Click `File > Open Dictionary...`\n     - Select Hammerspoon from the list of Applications\n     - This will now open a Dictionary containing all of the available Hammerspoon AppleScript commands.\n * Note that strings within the Lua code you pass from AppleScript can be delimited by `[[` and `]]` rather than normal quotes\n * Example:\n   ```lua\n   tell application \"Hammerspoon\"\n     execute lua code \"hs.alert([[Hello from AppleScript]])\"\n   end tell```","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"674","name":"allowAppleScript","notes":[" * AppleScript access is disallowed by default."," * However due to the way AppleScript support works, Hammerspoon will always allow AppleScript commands that are part of the \"Standard Suite\", such as `name`, `quit`, `version`, etc. However, Hammerspoon will only allow commands from the \"Hammerspoon Suite\" if `hs.allowAppleScript()` is set to `true`."," * For a full list of AppleScript Commands:","     - Open `/Applications/Utilities/Script Editor.app`","     - Click `File > Open Dictionary...`","     - Select Hammerspoon from the list of Applications","     - This will now open a Dictionary containing all of the available Hammerspoon AppleScript commands."," * Note that strings within the Lua code you pass from AppleScript can be delimited by `[[` and `]]` rather than normal quotes"," * Example:","   ```lua","   tell application \"Hammerspoon\"","     execute lua code \"hs.alert([[Hello from AppleScript]])\"","   end tell```"],"parameters":[" * state - an optional boolean which will set whether or not external Hammerspoon's AppleScript commands are allowed."],"returns":[" * A boolean, `true` if Hammerspoon's AppleScript commands are (or has just been) allowed, otherwise `false`."],"signature":"hs.allowAppleScript([state]) -> bool","stripped_doc":"","type":"Function"},"autoLaunch":{"def":"hs.autoLaunch([state]) -> bool","desc":"Set or display the \"Launch on Login\" status for Hammerspoon.","doc":"Set or display the \"Launch on Login\" status for Hammerspoon.\n\nParameters:\n * state - an optional boolean which will set whether or not Hammerspoon should be launched automatically when you log into your computer.\n\nReturns:\n * True if Hammerspoon is currently (or has just been) set to launch on login or False if Hammerspoon is not.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"66","name":"autoLaunch","notes":[],"parameters":[" * state - an optional boolean which will set whether or not Hammerspoon should be launched automatically when you log into your computer."],"returns":[" * True if Hammerspoon is currently (or has just been) set to launch on login or False if Hammerspoon is not."],"signature":"hs.autoLaunch([state]) -> bool","stripped_doc":"","type":"Function"},"automaticallyCheckForUpdates":{"def":"hs.automaticallyCheckForUpdates([setting]) -> bool","desc":"Gets and optionally sets the Hammerspoon option to automatically check for updates.","doc":"Gets and optionally sets the Hammerspoon option to automatically check for updates.\n\nParameters:\n * setting - an optional boolean variable indicating if Hammerspoon should (true) or should not (false) check for updates.\n\nReturns:\n * The current (or newly set) value indicating whether or not automatic update checks should occur for Hammerspoon.\n\nNotes:\n * If you are running a non-release or locally compiled version of Hammerspoon then the results of this function are unspecified.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"491","name":"automaticallyCheckForUpdates","notes":[" * If you are running a non-release or locally compiled version of Hammerspoon then the results of this function are unspecified."],"parameters":[" * setting - an optional boolean variable indicating if Hammerspoon should (true) or should not (false) check for updates."],"returns":[" * The current (or newly set) value indicating whether or not automatic update checks should occur for Hammerspoon."],"signature":"hs.automaticallyCheckForUpdates([setting]) -> bool","stripped_doc":"","type":"Function"},"cameraState":{"def":"hs.cameraState(shouldPrompt) -> boolean","desc":"Checks the Camera Permissions for Hammerspoon, and optionally allows you to prompt for permissions.","doc":"Checks the Camera Permissions for Hammerspoon, and optionally allows you to prompt for permissions.\n\nParameters:\n * shouldPrompt - an optional boolean value indicating if we should request camera access. Defaults to false.\n\nReturns:\n * `true` or `false` indicating whether or not Camera access is enabled for Hammerspoon.\n\nNotes:\n * Will always return `true` on macOS 10.13 or earlier.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"432","name":"cameraState","notes":[" * Will always return `true` on macOS 10.13 or earlier."],"parameters":[" * shouldPrompt - an optional boolean value indicating if we should request camera access. Defaults to false."],"returns":[" * `true` or `false` indicating whether or not Camera access is enabled for Hammerspoon."],"signature":"hs.cameraState(shouldPrompt) -> boolean","stripped_doc":"","type":"Function"},"canCheckForUpdates":{"def":"hs.canCheckForUpdates() -> boolean","desc":"Returns a boolean indicating whether or not the Sparkle framework is available to check for Hammerspoon updates.","doc":"Returns a boolean indicating whether or not the Sparkle framework is available to check for Hammerspoon updates.\n\nParameters:\n * None\n\nReturns:\n * a boolean indicating whether or not the Sparkle framework is available to check for Hammerspoon updates\n\nNotes:\n * The Sparkle framework is included in all regular releases of Hammerspoon but not included if you are running a non-release or locally compiled version of Hammerspoon, so this function can be used as a simple test to determine whether or not you are running a formal release Hammerspoon or not.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"625","name":"canCheckForUpdates","notes":[" * The Sparkle framework is included in all regular releases of Hammerspoon but not included if you are running a non-release or locally compiled version of Hammerspoon, so this function can be used as a simple test to determine whether or not you are running a formal release Hammerspoon or not."],"parameters":[" * None"],"returns":[" * a boolean indicating whether or not the Sparkle framework is available to check for Hammerspoon updates"],"signature":"hs.canCheckForUpdates() -> boolean","stripped_doc":"","type":"Function"},"checkForUpdates":{"def":"hs.checkForUpdates([silent]) -> none","desc":"Check for an update now, and if one is available, prompt the user to continue the update process.","doc":"Check for an update now, and if one is available, prompt the user to continue the update process.\n\nParameters:\n * silent - An optional boolean. If true, no UI will be displayed if an update is available. Defaults to false.\n\nReturns:\n * None\n\nNotes:\n * If you are running a non-release or locally compiled version of Hammerspoon then the results of this function are unspecified.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"550","name":"checkForUpdates","notes":[" * If you are running a non-release or locally compiled version of Hammerspoon then the results of this function are unspecified."],"parameters":[" * silent - An optional boolean. If true, no UI will be displayed if an update is available. Defaults to false."],"returns":[" * None"],"signature":"hs.checkForUpdates([silent]) -> none","stripped_doc":"","type":"Function"},"cleanUTF8forConsole":{"def":"hs.cleanUTF8forConsole(inString) -> outString","desc":"Returns a copy of the incoming string that can be displayed in the Hammerspoon console.  Invalid UTF8 sequences are converted to the Unicode Replacement Character and NULL (0x00) is converted to the Unicode Empty Set character.","doc":"Returns a copy of the incoming string that can be displayed in the Hammerspoon console.  Invalid UTF8 sequences are converted to the Unicode Replacement Character and NULL (0x00) is converted to the Unicode Empty Set character.\n\nParameters:\n * inString - the string to be cleaned up\n\nReturns:\n * outString - the cleaned up version of the input string.\n\nNotes:\n * This function is applied automatically to all output which appears in the Hammerspoon console, but not to the output provided by the `hs` command line tool.\n * This function does not modify the original string - to actually replace it, assign the result of this function to the original string.\n * This function is a more specifically targeted version of the `hs.utf8.fixUTF8(...)` function.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"764","name":"cleanUTF8forConsole","notes":[" * This function is applied automatically to all output which appears in the Hammerspoon console, but not to the output provided by the `hs` command line tool."," * This function does not modify the original string - to actually replace it, assign the result of this function to the original string."," * This function is a more specifically targeted version of the `hs.utf8.fixUTF8(...)` function."],"parameters":[" * inString - the string to be cleaned up"],"returns":[" * outString - the cleaned up version of the input string."],"signature":"hs.cleanUTF8forConsole(inString) -> outString","stripped_doc":"","type":"Function"},"closeConsole":{"def":"hs.closeConsole()","desc":"Closes the Hammerspoon Console window","doc":"Closes the Hammerspoon Console window\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"178","name":"closeConsole","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.closeConsole()","stripped_doc":"","type":"Function"},"closePreferences":{"def":"hs.closePreferences()","desc":"Closes the Hammerspoon Preferences window","doc":"Closes the Hammerspoon Preferences window\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"148","name":"closePreferences","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.closePreferences()","stripped_doc":"","type":"Function"},"completionsForInputString":{"def":"hs.completionsForInputString(completionWord) -> table of strings","desc":"Gathers tab completion options for the Console window","doc":"Gathers tab completion options for the Console window\n\nParameters:\n * completionWord - A string from the Console window's input field that completions are needed for\n\nReturns:\n * A table of strings, each of which will be shown as a possible completion option to the user\n\nNotes:\n * Hammerspoon provides a default implementation of this function, which can complete against the global Lua namespace, the 'hs' (i.e. extension) namespace, and object metatables. You can assign a new function to the variable to replace it with your own variant.","file":"extensions/_coresetup/_coresetup.lua","lineno":"584","name":"completionsForInputString","notes":[" * Hammerspoon provides a default implementation of this function, which can complete against the global Lua namespace, the 'hs' (i.e. extension) namespace, and object metatables. You can assign a new function to the variable to replace it with your own variant."],"parameters":[" * completionWord - A string from the Console window's input field that completions are needed for"],"returns":[" * A table of strings, each of which will be shown as a possible completion option to the user"],"signature":"hs.completionsForInputString(completionWord) -> table of strings","stripped_doc":"","type":"Variable"},"configdir":{"def":"hs.configdir","desc":"A string containing Hammerspoon's configuration directory. Typically `~/.hammerspoon/`","doc":"A string containing Hammerspoon's configuration directory. Typically `~/.hammerspoon/`","file":"extensions/_coresetup/_coresetup.lua","lineno":"44","name":"configdir","signature":"hs.configdir","stripped_doc":"","type":"Constant"},"consoleOnTop":{"def":"hs.consoleOnTop([state]) -> bool","desc":"Set or display whether or not the Hammerspoon console is always on top when visible.","doc":"Set or display whether or not the Hammerspoon console is always on top when visible.\n\nParameters:\n * state - an optional boolean which will set whether or not the Hammerspoon console is always on top when visible.\n\nReturns:\n * True if the console is currently set (or has just been) to be always on top when visible or False if it is not.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"102","name":"consoleOnTop","notes":[],"parameters":[" * state - an optional boolean which will set whether or not the Hammerspoon console is always on top when visible."],"returns":[" * True if the console is currently set (or has just been) to be always on top when visible or False if it is not."],"signature":"hs.consoleOnTop([state]) -> bool","stripped_doc":"","type":"Function"},"coroutineApplicationYield":{"def":"hs.coroutineApplicationYield([delay])","desc":"Yield coroutine to allow the Hammerspoon application to process other scheduled events and schedule a resume in the event application queue.","doc":"Yield coroutine to allow the Hammerspoon application to process other scheduled events and schedule a resume in the event application queue.\n\nParameters:\n * `delay` - an optional number, default `hs.math.minFloat`, specifying the number of seconds from when this function is executed that the `coroutine.resume` should be scheduled for.\n\nReturns:\n * None\n\nNotes:\n * this function will return an error if invoked outside of a coroutine.\n * unlike `coroutine.yield`, this function does not allow the passing of (new) information to or from the coroutine while it is running; this function is to allow long running tasks to yield time to the Hammerspoon application so other timers and scheduled events can occur without requiring the programmer to add code for an explicit resume.\n\n * this function is added to the lua `coroutine` library as `coroutine.applicationYield` as an alternative name.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"106","name":"coroutineApplicationYield","notes":[" * this function will return an error if invoked outside of a coroutine."," * unlike `coroutine.yield`, this function does not allow the passing of (new) information to or from the coroutine while it is running; this function is to allow long running tasks to yield time to the Hammerspoon application so other timers and scheduled events can occur without requiring the programmer to add code for an explicit resume.",""," * this function is added to the lua `coroutine` library as `coroutine.applicationYield` as an alternative name."],"parameters":[" * `delay` - an optional number, default `hs.math.minFloat`, specifying the number of seconds from when this function is executed that the `coroutine.resume` should be scheduled for."],"returns":[" * None"],"signature":"hs.coroutineApplicationYield([delay])","stripped_doc":" * this function is added to the lua `coroutine` library as `coroutine.applicationYield` as an alternative name.","type":"Function"},"dockIcon":{"def":"hs.dockIcon([state]) -> bool","desc":"Set or display whether or not the Hammerspoon dock icon is visible.","doc":"Set or display whether or not the Hammerspoon dock icon is visible.\n\nParameters:\n * state - an optional boolean which will set whether or not the Hammerspoon dock icon should be visible.\n\nReturns:\n * True if the icon is currently set (or has just been) to be visible or False if it is not.\n\nNotes:\n * This function is a wrapper to functions found in the `hs.dockicon` module, but is provided here to provide an interface consistent with other selectable preference items.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"262","name":"dockIcon","notes":[" * This function is a wrapper to functions found in the `hs.dockicon` module, but is provided here to provide an interface consistent with other selectable preference items."],"parameters":[" * state - an optional boolean which will set whether or not the Hammerspoon dock icon should be visible."],"returns":[" * True if the icon is currently set (or has just been) to be visible or False if it is not."],"signature":"hs.dockIcon([state]) -> bool","stripped_doc":"","type":"Function"},"dockIconClickCallback":{"def":"hs.dockIconClickCallback","desc":"An optional function that will be called when the Hammerspoon Dock Icon is clicked while the app is running","doc":"An optional function that will be called when the Hammerspoon Dock Icon is clicked while the app is running\n\nNotes:\n * If set, this callback will be called regardless of whether or not Hammerspoon shows its console window in response to a click (which can be enabled/disabled via `hs.openConsoleOnDockClick()`","file":"extensions/_coresetup/_coresetup.lua","lineno":"49","name":"dockIconClickCallback","notes":[" * If set, this callback will be called regardless of whether or not Hammerspoon shows its console window in response to a click (which can be enabled/disabled via `hs.openConsoleOnDockClick()`"],"signature":"hs.dockIconClickCallback","stripped_doc":"","type":"Variable"},"docstrings_json_file":{"def":"hs.docstrings_json_file","desc":"A string containing the full path to the `docs.json` file inside Hammerspoon's app bundle. This contains the full Hammerspoon API documentation and can be accessed in the Console using `help(\"someAPI\")`. It can also be loaded and processed by the `hs.doc` extension","doc":"A string containing the full path to the `docs.json` file inside Hammerspoon's app bundle. This contains the full Hammerspoon API documentation and can be accessed in the Console using `help(\"someAPI\")`. It can also be loaded and processed by the `hs.doc` extension","file":"extensions/_coresetup/_coresetup.lua","lineno":"144","name":"docstrings_json_file","signature":"hs.docstrings_json_file","stripped_doc":"","type":"Constant"},"execute":{"def":"hs.execute(command[, with_user_env]) -> output, status, type, rc","desc":"Runs a shell command, optionally loading the users shell environment first, and returns stdout as a string, followed by the same result codes as `os.execute` would return.","doc":"Runs a shell command, optionally loading the users shell environment first, and returns stdout as a string, followed by the same result codes as `os.execute` would return.\n\nParameters:\n * command - a string containing the shell command to execute\n * with_user_env - optional boolean argument which if provided and is true, executes the command in the users login shell as an \"interactive\" login shell causing the user's local profile (or other login scripts) to be loaded first.\n\nReturns:\n * output -- the stdout of the command as a string.  May contain an extra terminating new-line (\\n).\n * status -- `true` if the command terminated successfully or nil otherwise.\n * type   -- a string value of \"exit\" or \"signal\" indicating whether the command terminated of its own accord or if it was terminated by a signal (killed, segfault, etc.)\n * rc     -- if the command exited of its own accord, then this number will represent the exit code (usually 0 for success, not 0 for an error, though this is very command specific, so check man pages when there is a question).  If the command was killed by a signal, then this number corresponds to the signal type that caused the command to terminate.\n\nNotes:\n * Setting `with_user_env` to true does incur noticeable overhead, so it should only be used if necessary (to set the path or other environment variables).\n * Because this function returns the stdout as it's first return value, it is not quite a drop-in replacement for `os.execute`.  In most cases, it is probable that `stdout` will be the empty string when `status` is nil, but this is not guaranteed, so this trade off of shifting os.execute's results was deemed acceptable.\n * This particular function is most useful when you're more interested in the command's output then a simple check for completion and result codes.  If you only require the result codes or verification of command completion, then `os.execute` will be slightly more efficient.\n * If you need to execute commands that have spaces in their paths, use a form like: `hs.execute [[\"/Some/Path To/An/Executable\" \"--first-arg\" \"second-arg\"]]`","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"231","name":"execute","notes":[" * Setting `with_user_env` to true does incur noticeable overhead, so it should only be used if necessary (to set the path or other environment variables)."," * Because this function returns the stdout as it's first return value, it is not quite a drop-in replacement for `os.execute`.  In most cases, it is probable that `stdout` will be the empty string when `status` is nil, but this is not guaranteed, so this trade off of shifting os.execute's results was deemed acceptable."," * This particular function is most useful when you're more interested in the command's output then a simple check for completion and result codes.  If you only require the result codes or verification of command completion, then `os.execute` will be slightly more efficient."," * If you need to execute commands that have spaces in their paths, use a form like: `hs.execute [[\"/Some/Path To/An/Executable\" \"--first-arg\" \"second-arg\"]]`"],"parameters":[" * command - a string containing the shell command to execute"," * with_user_env - optional boolean argument which if provided and is true, executes the command in the users login shell as an \"interactive\" login shell causing the user's local profile (or other login scripts) to be loaded first."],"returns":[" * output -- the stdout of the command as a string.  May contain an extra terminating new-line (\\n)."," * status -- `true` if the command terminated successfully or nil otherwise."," * type   -- a string value of \"exit\" or \"signal\" indicating whether the command terminated of its own accord or if it was terminated by a signal (killed, segfault, etc.)"," * rc     -- if the command exited of its own accord, then this number will represent the exit code (usually 0 for success, not 0 for an error, though this is very command specific, so check man pages when there is a question).  If the command was killed by a signal, then this number corresponds to the signal type that caused the command to terminate."],"signature":"hs.execute(command[, with_user_env]) -> output, status, type, rc","stripped_doc":"","type":"Function"},"fileDroppedToDockIconCallback":{"def":"hs.fileDroppedToDockIconCallback","desc":"An optional function that will be called when a files are dragged to the Hammerspoon Dock Icon or sent via the Services menu","doc":"An optional function that will be called when a files are dragged to the Hammerspoon Dock Icon or sent via the Services menu\n\nNotes:\n * The function should accept a single parameter, which will be a string containing the full path to the file that was dragged to the dock icon\n * If multiple files are sent, this callback will be called once for each file\n * This callback will be triggered when ANY file type is dragged onto the Hammerspoon Dock Icon, however certain filetypes are also processed separately by Hammerspoon. For example, `hs.urlevent` will be triggered when the following filetypes are dropped onto the Dock Icon: HTML Documents (.html, .htm, .shtml, .jhtml), Plain text documents (.txt, .text), Web site locations (.url), XHTML documents (.xhtml, .xht, .xhtm, .xht).","file":"extensions/_coresetup/_coresetup.lua","lineno":"82","name":"fileDroppedToDockIconCallback","notes":[" * The function should accept a single parameter, which will be a string containing the full path to the file that was dragged to the dock icon"," * If multiple files are sent, this callback will be called once for each file"," * This callback will be triggered when ANY file type is dragged onto the Hammerspoon Dock Icon, however certain filetypes are also processed separately by Hammerspoon. For example, `hs.urlevent` will be triggered when the following filetypes are dropped onto the Dock Icon: HTML Documents (.html, .htm, .shtml, .jhtml), Plain text documents (.txt, .text), Web site locations (.url), XHTML documents (.xhtml, .xht, .xhtm, .xht)."],"signature":"hs.fileDroppedToDockIconCallback","stripped_doc":"","type":"Variable"},"focus":{"def":"hs.focus()","desc":"Makes Hammerspoon the foreground app.","doc":"Makes Hammerspoon the foreground app.\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"734","name":"focus","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.focus()","stripped_doc":"","type":"Function"},"getObjectMetatable":{"def":"hs.getObjectMetatable(name) -> table or nil","desc":"Fetches the Lua metatable for objects produced by an extension","doc":"Fetches the Lua metatable for objects produced by an extension\n\nParameters:\n * name - A string containing the name of a module to fetch object metadata for (e.g. `\"hs.screen\"`)\n\nReturns:\n * The extension's object metatable, or nil if an error occurred","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"748","name":"getObjectMetatable","notes":[],"parameters":[" * name - A string containing the name of a module to fetch object metadata for (e.g. `\"hs.screen\"`)"],"returns":[" * The extension's object metatable, or nil if an error occurred"],"signature":"hs.getObjectMetatable(name) -> table or nil","stripped_doc":"","type":"Function"},"help":{"def":"hs.help(identifier)","desc":"Prints the documentation for some part of Hammerspoon's API and Lua 5.3.  This function is actually sourced from hs.doc.help.","doc":"Prints the documentation for some part of Hammerspoon's API and Lua 5.3.  This function is actually sourced from hs.doc.help.\n\nParameters:\n * identifier - A string containing the signature of some part of Hammerspoon's API (e.g. `\"hs.reload\"`)\n\nReturns:\n * None\n\nNotes:\n * This function is mainly for runtime API help while using Hammerspoon's Console\n * You can also access the results of this function by the following methods from the console:\n   * help(\"identifier\") -- quotes are required, e.g. `help(\"hs.reload\")`\n   * help.identifier.path -- no quotes are required, e.g. `help.hs.reload`\n * Lua information can be accessed by using the `lua` prefix, rather than `hs`.\n   * the identifier `lua._man` provides the table of contents for the Lua 5.3 manual.  You can pull up a specific section of the lua manual by including the chapter (and subsection) like this: `lua._man._3_4_8`.\n   * the identifier `lua._C` will provide information specifically about the Lua C API for use when developing modules which require external libraries.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"370","name":"help","notes":[" * This function is mainly for runtime API help while using Hammerspoon's Console"," * You can also access the results of this function by the following methods from the console:","   * help(\"identifier\") -- quotes are required, e.g. `help(\"hs.reload\")`","   * help.identifier.path -- no quotes are required, e.g. `help.hs.reload`"," * Lua information can be accessed by using the `lua` prefix, rather than `hs`.","   * the identifier `lua._man` provides the table of contents for the Lua 5.3 manual.  You can pull up a specific section of the lua manual by including the chapter (and subsection) like this: `lua._man._3_4_8`.","   * the identifier `lua._C` will provide information specifically about the Lua C API for use when developing modules which require external libraries."],"parameters":[" * identifier - A string containing the signature of some part of Hammerspoon's API (e.g. `\"hs.reload\"`)"],"returns":[" * None"],"signature":"hs.help(identifier)","stripped_doc":"","type":"Function"},"hsdocs":{"def":"hs.hsdocs([identifier])","desc":"Display's Hammerspoon API documentation in a webview browser.","doc":"Display's Hammerspoon API documentation in a webview browser.\n\nParameters:\n * identifier - An optional string containing the signature of some part of Hammerspoon's API (e.g. `\"hs.reload\"`).  If no string is provided, then the table of contents for the Hammerspoon documentation is displayed.\n\nReturns:\n * None\n\nNotes:\n * You can also access the results of this function by the following methods from the console:\n   * hs.hsdocs.identifier.path -- no quotes are required, e.g. `hs.hsdocs.hs.reload`\n * See `hs.doc.hsdocs` for more information about the available settings for the documentation browser.\n * This function provides documentation for Hammerspoon modules, functions, and methods similar to the Hammerspoon Dash docset, but does not require any additional software.\n * This currently only provides documentation for the built in Hammerspoon modules, functions, and methods.  The Lua documentation and third-party modules are not presently supported, but may be added in a future release.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"393","name":"hsdocs","notes":[" * You can also access the results of this function by the following methods from the console:","   * hs.hsdocs.identifier.path -- no quotes are required, e.g. `hs.hsdocs.hs.reload`"," * See `hs.doc.hsdocs` for more information about the available settings for the documentation browser."," * This function provides documentation for Hammerspoon modules, functions, and methods similar to the Hammerspoon Dash docset, but does not require any additional software."," * This currently only provides documentation for the built in Hammerspoon modules, functions, and methods.  The Lua documentation and third-party modules are not presently supported, but may be added in a future release."],"parameters":[" * identifier - An optional string containing the signature of some part of Hammerspoon's API (e.g. `\"hs.reload\"`).  If no string is provided, then the table of contents for the Hammerspoon documentation is displayed."],"returns":[" * None"],"signature":"hs.hsdocs([identifier])","stripped_doc":"","type":"Function"},"loadSpoon":{"def":"hs.loadSpoon(name[, global]) -> Spoon object","desc":"Loads a Spoon","doc":"Loads a Spoon\n\nParameters:\n * name - The name of a Spoon (without the trailing `.spoon`)\n * global - An optional boolean. If true, this function will insert the spoon into Lua's global namespace as `spoon.NAME`. Defaults to true.\n\nReturns:\n * The object provided by the Spoon (which can be ignored if you chose to make the Spoon global)\n\nNotes:\n * Spoons are a way of distributing self-contained units of Lua functionality, for Hammerspoon. For more information, see https://github.com/Hammerspoon/hammerspoon/blob/master/SPOONS.md\n * This function will load the Spoon and call its `:init()` method if it has one. If you do not wish this to happen, or wish to use a Spoon that somehow doesn't fit with the behaviours of this function, you can also simply `require('name')` to load the Spoon\n * If the Spoon has a `:start()` method you are responsible for calling it before using the functionality of the Spoon.\n * If the Spoon provides documentation, it will be loaded by made available in hs.docs\n * To learn how to distribute your own code as a Spoon, see https://github.com/Hammerspoon/hammerspoon/blob/master/SPOONS.md","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"282","name":"loadSpoon","notes":[" * Spoons are a way of distributing self-contained units of Lua functionality, for Hammerspoon. For more information, see https://github.com/Hammerspoon/hammerspoon/blob/master/SPOONS.md"," * This function will load the Spoon and call its `:init()` method if it has one. If you do not wish this to happen, or wish to use a Spoon that somehow doesn't fit with the behaviours of this function, you can also simply `require('name')` to load the Spoon"," * If the Spoon has a `:start()` method you are responsible for calling it before using the functionality of the Spoon."," * If the Spoon provides documentation, it will be loaded by made available in hs.docs"," * To learn how to distribute your own code as a Spoon, see https://github.com/Hammerspoon/hammerspoon/blob/master/SPOONS.md"],"parameters":[" * name - The name of a Spoon (without the trailing `.spoon`)"," * global - An optional boolean. If true, this function will insert the spoon into Lua's global namespace as `spoon.NAME`. Defaults to true."],"returns":[" * The object provided by the Spoon (which can be ignored if you chose to make the Spoon global)"],"signature":"hs.loadSpoon(name[, global]) -> Spoon object","stripped_doc":"","type":"Function"},"menuIcon":{"def":"hs.menuIcon([state]) -> bool","desc":"Set or display whether or not the Hammerspoon menu icon is visible.","doc":"Set or display whether or not the Hammerspoon menu icon is visible.\n\nParameters:\n * state - an optional boolean which will set whether or not the Hammerspoon menu icon should be visible.\n\nReturns:\n * True if the icon is currently set (or has just been) to be visible or False if it is not.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"81","name":"menuIcon","notes":[],"parameters":[" * state - an optional boolean which will set whether or not the Hammerspoon menu icon should be visible."],"returns":[" * True if the icon is currently set (or has just been) to be visible or False if it is not."],"signature":"hs.menuIcon([state]) -> bool","stripped_doc":"","type":"Function"},"microphoneState":{"def":"hs.microphoneState(shouldPrompt) -> boolean","desc":"Checks the Microphone Permissions for Hammerspoon, and optionally allows you to prompt for permissions.","doc":"Checks the Microphone Permissions for Hammerspoon, and optionally allows you to prompt for permissions.\n\nParameters:\n * shouldPrompt - an optional boolean value indicating if we should request microphone access. Defaults to false.\n\nReturns:\n * `true` or `false` indicating whether or not Microphone access is enabled for Hammerspoon.\n\nNotes:\n * Will always return `true` on macOS 10.13 or earlier.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"373","name":"microphoneState","notes":[" * Will always return `true` on macOS 10.13 or earlier."],"parameters":[" * shouldPrompt - an optional boolean value indicating if we should request microphone access. Defaults to false."],"returns":[" * `true` or `false` indicating whether or not Microphone access is enabled for Hammerspoon."],"signature":"hs.microphoneState(shouldPrompt) -> boolean","stripped_doc":"","type":"Function"},"open":{"def":"hs.open(filePath)","desc":"Opens a file as if it were opened with /usr/bin/open","doc":"Opens a file as if it were opened with /usr/bin/open\n\nParameters:\n * filePath - A string containing the path to a file/bundle to open\n\nReturns:\n * A boolean, true if the file was opened successfully, otherwise false","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"192","name":"open","notes":[],"parameters":[" * filePath - A string containing the path to a file/bundle to open"],"returns":[" * A boolean, true if the file was opened successfully, otherwise false"],"signature":"hs.open(filePath)","stripped_doc":"","type":"Function"},"openAbout":{"def":"hs.openAbout()","desc":"Displays the OS X About panel for Hammerspoon; implicitly focuses Hammerspoon.","doc":"Displays the OS X About panel for Hammerspoon; implicitly focuses Hammerspoon.\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"117","name":"openAbout","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.openAbout()","stripped_doc":"","type":"Function"},"openConsole":{"def":"hs.openConsole([bringToFront])","desc":"Opens the Hammerspoon Console window and optionally focuses it.","doc":"Opens the Hammerspoon Console window and optionally focuses it.\n\nParameters:\n * bringToFront - if true (default), the console will be focused as well as opened.\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"162","name":"openConsole","notes":[],"parameters":[" * bringToFront - if true (default), the console will be focused as well as opened."],"returns":[" * None"],"signature":"hs.openConsole([bringToFront])","stripped_doc":"","type":"Function"},"openConsoleOnDockClick":{"def":"hs.openConsoleOnDockClick([state]) -> bool","desc":"Set or display whether or not the Console window will open when the Hammerspoon dock icon is clicked","doc":"Set or display whether or not the Console window will open when the Hammerspoon dock icon is clicked\n\nParameters:\n * state - An optional boolean, true if the console window should open, false if not\n\nReturns:\n * A boolean, true if the console window will open when the dock icon\n\nNotes:\n * This only refers to dock icon clicks while Hammerspoon is already running. The console window is not opened by launching the app","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"710","name":"openConsoleOnDockClick","notes":[" * This only refers to dock icon clicks while Hammerspoon is already running. The console window is not opened by launching the app"],"parameters":[" * state - An optional boolean, true if the console window should open, false if not"],"returns":[" * A boolean, true if the console window will open when the dock icon"],"signature":"hs.openConsoleOnDockClick([state]) -> bool","stripped_doc":"","type":"Function"},"openPreferences":{"def":"hs.openPreferences()","desc":"Displays the Hammerspoon Preferences panel; implicitly focuses Hammerspoon.","doc":"Displays the Hammerspoon Preferences panel; implicitly focuses Hammerspoon.\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"132","name":"openPreferences","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.openPreferences()","stripped_doc":"","type":"Function"},"preferencesDarkMode":{"def":"hs.preferencesDarkMode([state]) -> bool","desc":"Set or display whether or not the Preferences panel should display in dark mode.","doc":"Set or display whether or not the Preferences panel should display in dark mode.\n\nParameters:\n * state - an optional boolean which will set whether or not the Preferences panel should display in dark mode.\n\nReturns:\n * A boolean, true if dark mode is enabled otherwise false.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"652","name":"preferencesDarkMode","notes":[],"parameters":[" * state - an optional boolean which will set whether or not the Preferences panel should display in dark mode."],"returns":[" * A boolean, true if dark mode is enabled otherwise false."],"signature":"hs.preferencesDarkMode([state]) -> bool","stripped_doc":"","type":"Function"},"printf":{"def":"hs.printf(format, ...)","desc":"Prints formatted strings to the Console","doc":"Prints formatted strings to the Console\n\nParameters:\n * format - A format string\n * ... - Zero or more arguments to fill the placeholders in the format string\n\nReturns:\n * None\n\nNotes:\n * This is a simple wrapper around the Lua code `print(string.format(...))`.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"13","name":"printf","notes":[" * This is a simple wrapper around the Lua code `print(string.format(...))`."],"parameters":[" * format - A format string"," * ... - Zero or more arguments to fill the placeholders in the format string"],"returns":[" * None"],"signature":"hs.printf(format, ...)","stripped_doc":"","type":"Function"},"processInfo":{"def":"hs.processInfo","desc":"A table containing read-only information about the Hammerspoon application instance currently running.","doc":"A table containing read-only information about the Hammerspoon application instance currently running.","file":"Hammerspoon/MJLua.m","lineno":"228","name":"processInfo","signature":"hs.processInfo","stripped_doc":"","type":"Constant"},"rawprint":{"def":"hs.rawprint(aString)","desc":"The original Lua print() function","doc":"The original Lua print() function\n\nParameters:\n * aString - A string to be printed\n\nReturns:\n * None\n\nNotes:\n * Hammerspoon overrides Lua's print() function, but this is a reference we retain to is, should you need it for any reason","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"205","name":"rawprint","notes":[" * Hammerspoon overrides Lua's print() function, but this is a reference we retain to is, should you need it for any reason"],"parameters":[" * aString - A string to be printed"],"returns":[" * None"],"signature":"hs.rawprint(aString)","stripped_doc":"","type":"Function"},"relaunch":{"def":"hs.relaunch()","desc":"Quits and relaunches Hammerspoon.","doc":"Quits and relaunches Hammerspoon.\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"92","name":"relaunch","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.relaunch()","stripped_doc":"","type":"Function"},"reload":{"def":"hs.reload()","desc":"Reloads your init-file in a fresh Lua environment.","doc":"Reloads your init-file in a fresh Lua environment.\n\nParameters:\n * None\n\nReturns:\n * None","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"212","name":"reload","notes":[],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.reload()","stripped_doc":"","type":"Function"},"screenRecordingState":{"def":"hs.screenRecordingState(shouldPrompt) -> isEnabled","desc":"Checks the Screen Recording Permissions for Hammerspoon, and optionally allows you to prompt for permissions.","doc":"Checks the Screen Recording Permissions for Hammerspoon, and optionally allows you to prompt for permissions.\n\nParameters:\n * shouldPrompt - an optional boolean value indicating if the dialog box asking if the System Preferences application should be opened should be presented when Screen Recording is not currently enabled for Hammerspoon.  Defaults to false.\n\nReturns:\n * True or False indicating whether or not Screen Recording is enabled for Hammerspoon.\n\nNotes:\n * If you trigger the prompt and the user denies it, you cannot bring up the prompt again - the user must manually enable it in System Preferences.","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"347","name":"screenRecordingState","notes":[" * If you trigger the prompt and the user denies it, you cannot bring up the prompt again - the user must manually enable it in System Preferences."],"parameters":[" * shouldPrompt - an optional boolean value indicating if the dialog box asking if the System Preferences application should be opened should be presented when Screen Recording is not currently enabled for Hammerspoon.  Defaults to false."],"returns":[" * True or False indicating whether or not Screen Recording is enabled for Hammerspoon."],"signature":"hs.screenRecordingState(shouldPrompt) -> isEnabled","stripped_doc":"","type":"Function"},"showError":{"def":"hs.showError(err)","desc":"Shows an error to the user, using Hammerspoon's Console","doc":"Shows an error to the user, using Hammerspoon's Console\n\nParameters:\n * err - A string containing an error message\n\nReturns:\n * None\n\nNotes:\n * This function is called whenever an (uncaught) error occurs or is thrown (via `error()`)\n * The default implementation shows a notification, opens the Console, and prints the error message and stacktrace\n * You can override this function if you wish to route errors differently (e.g. for remote systems)","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"149","name":"showError","notes":[" * This function is called whenever an (uncaught) error occurs or is thrown (via `error()`)"," * The default implementation shows a notification, opens the Console, and prints the error message and stacktrace"," * You can override this function if you wish to route errors differently (e.g. for remote systems)"],"parameters":[" * err - A string containing an error message"],"returns":[" * None"],"signature":"hs.showError(err)","stripped_doc":"","type":"Function"},"shutdownCallback":{"def":"hs.shutdownCallback","desc":"An optional function that will be called when the Lua environment is being destroyed (either because Hammerspoon is exiting or reloading its config)","doc":"An optional function that will be called when the Lua environment is being destroyed (either because Hammerspoon is exiting or reloading its config)\n\nNotes:\n * This function should not perform any asynchronous tasks\n * You do not need to fastidiously destroy objects you have created, this callback exists purely for utility reasons (e.g. serialising state, destroying system resources that will not be released by normal Lua garbage collection processes, etc)","file":"extensions/_coresetup/_coresetup.lua","lineno":"57","name":"shutdownCallback","notes":[" * This function should not perform any asynchronous tasks"," * You do not need to fastidiously destroy objects you have created, this callback exists purely for utility reasons (e.g. serialising state, destroying system resources that will not be released by normal Lua garbage collection processes, etc)"],"signature":"hs.shutdownCallback","stripped_doc":"","type":"Variable"},"textDroppedToDockIconCallback":{"def":"hs.textDroppedToDockIconCallback","desc":"An optional function that will be called when text is dragged to the Hammerspoon Dock Icon or sent via the Services menu","doc":"An optional function that will be called when text is dragged to the Hammerspoon Dock Icon or sent via the Services menu\n\nNotes:\n * The function should accept a single parameter, which will be a string containing the text that was dragged to the dock icon","file":"extensions/_coresetup/_coresetup.lua","lineno":"74","name":"textDroppedToDockIconCallback","notes":[" * The function should accept a single parameter, which will be a string containing the text that was dragged to the dock icon"],"signature":"hs.textDroppedToDockIconCallback","stripped_doc":"","type":"Variable"},"toggleConsole":{"def":"hs.toggleConsole()","desc":"Toggles the visibility of the console","doc":"Toggles the visibility of the console\n\nParameters:\n * None\n\nReturns:\n * None\n\nNotes:\n * If the console is not currently open, it will be opened. If it is open and not the focused window, it will be brought forward and focused.\n * If the console is focused, it will be closed.","examples":[],"file":"extensions/_coresetup/_coresetup.lua","lineno":"181","name":"toggleConsole","notes":[" * If the console is not currently open, it will be opened. If it is open and not the focused window, it will be brought forward and focused."," * If the console is focused, it will be closed."],"parameters":[" * None"],"returns":[" * None"],"signature":"hs.toggleConsole()","stripped_doc":"","type":"Function"},"updateAvailable":{"def":"hs.updateAvailable() -> string or false, string","desc":"Gets the version & build number of an available update","doc":"Gets the version & build number of an available update\n\nParameters:\n * None\n\nReturns:\n * A string containing the display version of the latest release, or a boolean false if no update is available\n * A string containing the build number of the latest release, or `nil` if no update is available\n\nNotes:\n * This is not a live check, it is a cached result of whatever the previous update check found. By default Hammerspoon checks for updates every few hours, but you can also add your own timer to check for updates more frequently with `hs.checkForUpdates()`","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"589","name":"updateAvailable","notes":[" * This is not a live check, it is a cached result of whatever the previous update check found. By default Hammerspoon checks for updates every few hours, but you can also add your own timer to check for updates more frequently with `hs.checkForUpdates()`"],"parameters":[" * None"],"returns":[" * A string containing the display version of the latest release, or a boolean false if no update is available"," * A string containing the build number of the latest release, or `nil` if no update is available"],"signature":"hs.updateAvailable() -> string or false, string","stripped_doc":"","type":"Function"},"uploadCrashData":{"def":"hs.uploadCrashData([state]) -> bool","desc":"Get or set the \"Upload Crash Data\" preference for Hammerspoon","doc":"Get or set the \"Upload Crash Data\" preference for Hammerspoon\n\nParameters:\n * state - An optional boolean, true to upload crash reports, false to not\n\nReturns:\n * True if Hammerspoon is currently (or has just been) set to upload crash data or False otherwise\n\nNotes:\n * If at all possible, please do allow Hammerspoon to upload crash reports to us, it helps a great deal in keeping Hammerspoon stable\n * Our Privacy Policy can be found here: [https://www.hammerspoon.org/privacy.html](https://www.hammerspoon.org/privacy.html)","examples":[],"file":"Hammerspoon/MJLua.m","lineno":"47","name":"uploadCrashData","notes":[" * If at all possible, please do allow Hammerspoon to upload crash reports to us, it helps a great deal in keeping Hammerspoon stable"," * Our Privacy Policy can be found here: [https://www.hammerspoon.org/privacy.html](https://www.hammerspoon.org/privacy.html)"],"parameters":[" * state - An optional boolean, true to upload crash reports, false to not"],"returns":[" * True if Hammerspoon is currently (or has just been) set to upload crash data or False otherwise"],"signature":"hs.uploadCrashData([state]) -> bool","stripped_doc":"","type":"Function"}}
